zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_power.h
/*
 * Copyright 2026 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef FSL_POWER_H
#define FSL_POWER_H

#include "fsl_common.h"
#include "fsl_pmu.h"
#include "fsl_pdcon.h"
#include "fsl_memcon.h"
#include "fsl_vbatcon.h"
#include "fsl_powercon.h"

/*! @brief When set, VDD_CORE is supplied by an external PF9453 PMIC (BUCK2) instead of the on-chip
 *  DCDC. This is a pure compile-time choice: with the macro set, all VDD_CORE handling is compiled to
 *  go through the PF9453; unset, the on-chip DCDC path is compiled and there is no fsl_pf9453
 *  dependency. There is no runtime enable flag. */
#ifndef MCUX_POWER_PF9453_SUPPLY
#define MCUX_POWER_PF9453_SUPPLY 0
#endif

/*!
 * @addtogroup power
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @name Driver version */
/*@{*/
/*! @brief power driver version 2.0.0. */
#define FSL_POWER_DRIVER_VERSION (MAKE_VERSION(2, 0, 0))
/*@}*/

/*!
 * @brief PMU analog state - word-sized bitfield union that overlays
 *        POWERCON_SOC_CTRL.PMUCFG_ACTIVE / PMUCFG_STBY.
 *
 * Write `.word` directly to the PMUCFG register via POWERCON P-Channel.
 */
typedef union _power_pmu_state
{
    struct
    {
        uint32_t sensorTemp : 1;     /*!< bit[0]      Temperature sensor enable */
        uint32_t sensor0V8 : 1;      /*!< bit[1]      VDD_0V8 sensor enable */
        uint32_t sensor1V8 : 1;      /*!< bit[2]      VDD_1V8 sensor enable */
        uint32_t sensorVdda : 1;     /*!< bit[3]      VDDA_1V8 sensor enable */
        uint32_t sensorCore : 1;     /*!< bit[4]      VDD_CORE sensor enable */
        uint32_t sensorPmu : 1;      /*!< bit[5]      VDD_PMU sensor enable */
        uint32_t hqref : 1;          /*!< bit[6]      High-quality reference enable */
        uint32_t dcdcMode : 1;       /*!< bit[7]      DCDC mode: 0=PFM, 1=PWM */
        uint32_t ldo0V8Mode : 2;     /*!< bits[9:8]   LDO_VDD_0V8:  0=off, 1=HP, 2=LP */
        uint32_t ldo1V8Mode : 2;     /*!< bits[11:10] LDO_VDD_1V8:  0=off, 1=HP, 2=LP */
        uint32_t ldoVdda1V8Mode : 2; /*!< bits[13:12] LDO_VDDA_1V8: 0=off, 1=HP, 2=LP, 3=ULP */
        uint32_t dcdcOffPmuRet : 1;  /*!< bit[14]     DCDC off when PMU_MODE=RET/BB */
        uint32_t coreLvl : 5;        /*!< bits[19:15] VDD_CORE DAC: 0x00=0.8 V (others TBD) */
        uint32_t pmuMode : 3;        /*!< bits[22:20] PMU mode: 0=HP, 1=HP-prog, 2=LP,
                                                       3=RET, 4=BB */
        uint32_t : 9;                /*!< bits[31:23] Reserved; write as zero */
    };
    uint32_t word;                   /*!< Raw 32-bit value; write directly to PMUCFG_ACTIVE / PMUCFG_STBY */
} power_pmu_state_t;

/*! @brief CMC/SSC step operating mode. */
typedef enum _power_step_mode
{
    kPOWER_StepModeHandshake = 0U, /*!< Wait for handshake ACK (hardware reset default) */
    kPOWER_StepModeCount     = 1U, /*!< Advance after a fixed count of POWERCON clocks */
} power_step_mode_t;

/*!
 * @brief Configuration for one CMC or SSC step (sleep and wakeup directions).
 *
 * `countValue` is used only when sleepMode or wakeupMode is kPOWER_StepModeCount.
 * All steps within the same CMC/SSC block share one COUNT register - if multiple
 * steps use count mode their countValue fields MUST be identical.
 */
typedef struct _power_step_config
{
    power_step_mode_t sleepMode;  /*!< Mode for the sleep (entry) direction */
    power_step_mode_t wakeupMode; /*!< Mode for the wakeup (exit) direction */
    uint32_t countValue;          /*!< POWERCON clock cycles; ignored for Handshake mode */
} power_step_config_t;

/*!
 * @brief Step configuration for one CMC instance (5 steps).
 *
 * Each CMC instance (CMC0, CMC1, CMC2) has its own step-mode mask and COUNT register.
 * Different CMC instances may require different step modes or count values.
 */
typedef struct _power_cmc_step_config
{
    power_step_config_t busMasterLpcg; /*!< STEP1: Bus master LPCG handshake/gate */
    power_step_config_t busSlaveLpcg;  /*!< STEP2: Bus slave LPCG handshake/gate */
    power_step_config_t rootClockGate; /*!< STEP3: SS root clock gate/ungate */
    power_step_config_t clockSource;   /*!< STEP4: Clock source via P-Channel */
    power_step_config_t powerDomain;   /*!< STEP5: Power domain control (PDCON) */
} power_cmc_step_config_t;

/*!
 * @brief Init-time SoC handshake routing configuration.
 *
 * Configures the routing of root clocks and clock sources to CMC handshake
 * partners (POWERCON HSK_SEL registers) and PDCON per-domain handshake masks.
 * Pass via @ref power_policy_config_t::handshakeRouting (or NULL for POR defaults),
 * or pass directly to POWER_SetHandshakeRouting() for post-init reconfiguration.
 */
typedef struct _power_handshake_routing_config
{
    uint32_t rcgcfgHskSel;               /*!< POWERCON RCGCFG_HSK_SEL: root clock -> CMC routing. */
    uint32_t csrccfgHskSel;              /*!< POWERCON CSRCCFG_HSK_SEL: clock source -> CMC routing, word 0. */
    uint32_t csrccfgHskSel1;             /*!< POWERCON CSRCCFG_HSK_SEL1: clock source -> CMC routing, word 1. */
    pdcon_handshake_mask_t domainHsk[6]; /*!< PDCON HSKCTRL per-domain handshake mask, indexed by domain (0-5). */
} power_handshake_routing_config_t;

#if MCUX_POWER_PF9453_SUPPLY
/*!
 * @brief External-supply (PF9453 PMIC) I2C access, handed to POWER_InitExtSupply() so fsl_power can drive
 *        VDD_CORE (BUCK2) directly. Present only when MCUX_POWER_PF9453_SUPPLY is set. These are
 *        runtime function-pointer data (the board's I2C transport), NOT a mode switch — the compile
 *        macro is the only switch. Signatures match the PF9453 driver's I2C callback contract.
 */
typedef struct _power_ext_supply_config
{
    status_t (*I2C_SendFunc)(uint8_t deviceAddress, uint32_t subAddress, uint8_t subAddressSize,
                             uint8_t *txBuff, uint8_t txBuffSize); /*!< I2C write callback (board). */
    status_t (*I2C_ReceiveFunc)(uint8_t deviceAddress, uint32_t subAddress, uint8_t subAddressSize,
                                uint8_t *rxBuff, uint8_t rxBuffSize); /*!< I2C read callback (board). */
    uint8_t slaveAddress; /*!< PF9453 7-bit I2C address (OTP-dependent; default 0x32). */
} power_ext_supply_config_t;
#endif /* MCUX_POWER_PF9453_SUPPLY */

/*! @brief Configuration passed to POWER_SetPolicy(). */
typedef struct _power_policy_config
{
    /* Per-CMC instance step configuration (RT2660-specific mapping) */
    power_cmc_step_config_t cmcCpu;  /*!< CMC0 - CPU / M85 core (COMPUTE_SS domain) */
    power_cmc_step_config_t cmcMain; /*!< CMC1 - MAIN domain (eDMA3 + eDMA5 DMA wakeup) */
    power_cmc_step_config_t cmcWake; /*!< CMC2 - WAKE domain (eDMA3 DMA wakeup) */

    /* SSC steps */
    power_step_config_t sscPmu;  /*!< SSC STEP1: PMU standby/exit via P-Channel */
    power_step_config_t sscPmic; /*!< SSC STEP2: PMIC standby/exit */

    /*!< Init-time SoC handshake routing (HSK_SEL routing and PDCON HSKCTRL).
     *   NULL = apply POR-default values (hardware reset defaults).
     *   Non-NULL = apply *handshakeRouting directly (skips internal default lookup). */
    const power_handshake_routing_config_t *handshakeRouting;
} power_policy_config_t;

/*!
 * @brief Encoded wakeup source for POWER_EnableWakeupSource() / POWER_DisableWakeupSource().
 *
 * Encoding: bits[31:28] = wakeup path; remaining bits = source index.
 *   0x0xxxxxxx : IRQ wakeup   -> CMC0 IRQ_WAKEUP_MASK  (NVIC index 0-383)
 *   0x1xxxxxxx : MAIN DMA     -> CMC1 DMA_WAKEUP_MASK  (RM wakeup source index 0-63)
 *   0x2xxxxxxx : WAKE DMA     -> CMC2 DMA_WAKEUP_MASK  (RM wakeup source index 31-43)
 *
 * DMA wakeup source index is the RM Chapter 4 peripheral index - NOT an eDMA channel number.
 * One peripheral maps to one index regardless of how many DMA request lines it uses.
 *
 * Use the named enum members for known peripherals.
 * Use the constructor macros (POWER_WAKEUP_IRQ / POWER_WAKEUP_MAIN_DMA /
 * POWER_WAKEUP_WAKE_DMA) when the source index is determined at run time.
 *
 * Wakeup sources are accumulated in SW state; POWERCON registers are written
 * inside POWER_Enter*() via the internal POWER_ApplyWakeupSources() call.
 *
 * Power-mode applicability (RT2660 domain power map):
 *   WAKE domain : Sleep, Deep Sleep, Power Down
 *   VBAT domain : Sleep, Deep Sleep, Power Down, Deep Power Down (DPD1)
 *   HSP  domain : Sleep, Deep Sleep - HSP is in PD_MAIN (on in Sleep and Deep Sleep,
 *                 off in Power Down and deeper). In Deep Sleep the functional clock is
 *                 gated, so an HSP wakeup source must use a clock-less event (e.g. the
 *                 LPUART RX active-edge, BAUD[RXEDGIE]); a clocked interrupt fires in
 *                 Sleep only.
 *   MAIN DMA (CMC1) : Sleep, Deep Sleep
 *   WAKE DMA (CMC2) : Sleep, Deep Sleep, Power Down
 */
typedef enum _power_wakeup_source
{
    /* ----------------------------------------------------------------
     * CMPT domain - CMC0 IRQ_WAKEUP_MASK (IRQn 0-24)
     * ---------------------------------------------------------------- */
    kPOWER_WakeupIrq_CmptCm85Cti      = CMPT_CM85_CTI_IRQn,       /*!< CMPT CM85 CTI (0) */
    kPOWER_WakeupIrq_CmptCm85EccError = CMPT_CM85_ECC_ERROR_IRQn, /*!< CMPT CM85 ECC error (3) */
    kPOWER_WakeupIrq_CmptCm85Mcm      = CMPT_CM85_MCM_IRQn,       /*!< CMPT CM85 MCM (6) */
    kPOWER_WakeupIrq_CmptTrdc         = CMPT_TRDC_IRQn,           /*!< CMPT TRDC (7) */
#if defined(MIMXRT2663_SERIES) || defined(MIMXRT2661_SERIES)
    kPOWER_WakeupIrq_CmptNpu          = CMPT_NPU_IRQn,            /*!< CMPT NPU (8) */
#endif
    kPOWER_WakeupIrq_CmptSramctl0     = CMPT_SRAMCTL_0_IRQn,      /*!< CMPT SRAMCTL0 (9) */
    kPOWER_WakeupIrq_CmptSramctl1     = CMPT_SRAMCTL_1_IRQn,      /*!< CMPT SRAMCTL1 (10) */
    kPOWER_WakeupIrq_CmptSramctl2     = CMPT_SRAMCTL_2_IRQn,      /*!< CMPT SRAMCTL2 (11) */
    kPOWER_WakeupIrq_CmptFreqme       = CMPT_FREQME_IRQn,         /*!< CMPT FREQME (16) */
    kPOWER_WakeupIrq_CmptLlc          = CMPT_LLC_IRQn,            /*!< CMPT LLC (20) */
    kPOWER_WakeupIrq_CmptDap          = CMPT_DAP_IRQn,            /*!< CMPT DAP (24) */

    /* ----------------------------------------------------------------
     * MAIN + SYSCON domain - CMC0 IRQ_WAKEUP_MASK (IRQn 25-96)
     * PD_MAIN powered in Sleep and Deep Sleep; off in Power Down and deeper.
     * ---------------------------------------------------------------- */
    kPOWER_WakeupIrq_MainTrdc       = MAIN_TRDC_IRQn,          /*!< MAIN TRDC (25) */
    kPOWER_WakeupIrq_MainAhb2Axi    = MAIN_AHB2AXI_IRQn,       /*!< MAIN AHB2AXI bus error (26) */
    kPOWER_WakeupIrq_MainMmu        = MAIN_MMU_IRQn,           /*!< MAIN MMU (28) */
    kPOWER_WakeupIrq_MainEdma3Ch0   = MAIN_EDMA3_CH0_IRQn,     /*!< MAIN eDMA3 ch 0 IRQ (29) */
    kPOWER_WakeupIrq_MainEdma3Ch1   = MAIN_EDMA3_CH1_IRQn,     /*!< MAIN eDMA3 ch 1 IRQ (30) */
    kPOWER_WakeupIrq_MainEdma3Ch2   = MAIN_EDMA3_CH2_IRQn,     /*!< MAIN eDMA3 ch 2 IRQ (31) */
    kPOWER_WakeupIrq_MainEdma3Ch3   = MAIN_EDMA3_CH3_IRQn,     /*!< MAIN eDMA3 ch 3 IRQ (32) */
    kPOWER_WakeupIrq_MainEdma3Ch4   = MAIN_EDMA3_CH4_IRQn,     /*!< MAIN eDMA3 ch 4 IRQ (33) */
    kPOWER_WakeupIrq_MainEdma3Ch5   = MAIN_EDMA3_CH5_IRQn,     /*!< MAIN eDMA3 ch 5 IRQ (34) */
    kPOWER_WakeupIrq_MainEdma3Ch6   = MAIN_EDMA3_CH6_IRQn,     /*!< MAIN eDMA3 ch 6 IRQ (35) */
    kPOWER_WakeupIrq_MainEdma3Ch7   = MAIN_EDMA3_CH7_IRQn,     /*!< MAIN eDMA3 ch 7 IRQ (36) */
    kPOWER_WakeupIrq_MainEdma3Ch8   = MAIN_EDMA3_CH8_IRQn,     /*!< MAIN eDMA3 ch 8 IRQ (37) */
    kPOWER_WakeupIrq_MainEdma3Ch9   = MAIN_EDMA3_CH9_IRQn,     /*!< MAIN eDMA3 ch 9 IRQ (38) */
    kPOWER_WakeupIrq_MainEdma3Ch10  = MAIN_EDMA3_CH10_IRQn,    /*!< MAIN eDMA3 ch 10 IRQ (39) */
    kPOWER_WakeupIrq_MainEdma3Ch11  = MAIN_EDMA3_CH11_IRQn,    /*!< MAIN eDMA3 ch 11 IRQ (40) */
    kPOWER_WakeupIrq_MainEdma3Ch12  = MAIN_EDMA3_CH12_IRQn,    /*!< MAIN eDMA3 ch 12 IRQ (41) */
    kPOWER_WakeupIrq_MainEdma3Ch13  = MAIN_EDMA3_CH13_IRQn,    /*!< MAIN eDMA3 ch 13 IRQ (42) */
    kPOWER_WakeupIrq_MainEdma3Ch14  = MAIN_EDMA3_CH14_IRQn,    /*!< MAIN eDMA3 ch 14 IRQ (43) */
    kPOWER_WakeupIrq_MainEdma3Ch15  = MAIN_EDMA3_CH15_IRQn,    /*!< MAIN eDMA3 ch 15 IRQ (44) */
    kPOWER_WakeupIrq_MainEdma3Ch16  = MAIN_EDMA3_CH16_IRQn,    /*!< MAIN eDMA3 ch 16 IRQ (45) */
    kPOWER_WakeupIrq_MainEdma3Ch17  = MAIN_EDMA3_CH17_IRQn,    /*!< MAIN eDMA3 ch 17 IRQ (46) */
    kPOWER_WakeupIrq_MainEdma3Ch18  = MAIN_EDMA3_CH18_IRQn,    /*!< MAIN eDMA3 ch 18 IRQ (47) */
    kPOWER_WakeupIrq_MainEdma3Ch19  = MAIN_EDMA3_CH19_IRQn,    /*!< MAIN eDMA3 ch 19 IRQ (48) */
    kPOWER_WakeupIrq_MainEdma3Ch20  = MAIN_EDMA3_CH20_IRQn,    /*!< MAIN eDMA3 ch 20 IRQ (49) */
    kPOWER_WakeupIrq_MainEdma3Ch21  = MAIN_EDMA3_CH21_IRQn,    /*!< MAIN eDMA3 ch 21 IRQ (50) */
    kPOWER_WakeupIrq_MainEdma3Ch22  = MAIN_EDMA3_CH22_IRQn,    /*!< MAIN eDMA3 ch 22 IRQ (51) */
    kPOWER_WakeupIrq_MainEdma3Ch23  = MAIN_EDMA3_CH23_IRQn,    /*!< MAIN eDMA3 ch 23 IRQ (52) */
    kPOWER_WakeupIrq_MainEdma3Ch24  = MAIN_EDMA3_CH24_IRQn,    /*!< MAIN eDMA3 ch 24 IRQ (53) */
    kPOWER_WakeupIrq_MainEdma3Ch25  = MAIN_EDMA3_CH25_IRQn,    /*!< MAIN eDMA3 ch 25 IRQ (54) */
    kPOWER_WakeupIrq_MainEdma3Ch26  = MAIN_EDMA3_CH26_IRQn,    /*!< MAIN eDMA3 ch 26 IRQ (55) */
    kPOWER_WakeupIrq_MainEdma3Ch27  = MAIN_EDMA3_CH27_IRQn,    /*!< MAIN eDMA3 ch 27 IRQ (56) */
    kPOWER_WakeupIrq_MainEdma3Ch28  = MAIN_EDMA3_CH28_IRQn,    /*!< MAIN eDMA3 ch 28 IRQ (57) */
    kPOWER_WakeupIrq_MainEdma3Ch29  = MAIN_EDMA3_CH29_IRQn,    /*!< MAIN eDMA3 ch 29 IRQ (58) */
    kPOWER_WakeupIrq_MainEdma3Ch30  = MAIN_EDMA3_CH30_IRQn,    /*!< MAIN eDMA3 ch 30 IRQ (59) */
    kPOWER_WakeupIrq_MainEdma3Ch31  = MAIN_EDMA3_CH31_IRQn,    /*!< MAIN eDMA3 ch 31 IRQ (60) */
    kPOWER_WakeupIrq_MainEdma5Ch0   = MAIN_EDMA5_CH0_IRQn,     /*!< MAIN eDMA5 ch 0 IRQ (61) */
    kPOWER_WakeupIrq_MainEdma5Ch1   = MAIN_EDMA5_CH1_IRQn,     /*!< MAIN eDMA5 ch 1 IRQ (62) */
    kPOWER_WakeupIrq_MainEdma5Ch2   = MAIN_EDMA5_CH2_IRQn,     /*!< MAIN eDMA5 ch 2 IRQ (63) */
    kPOWER_WakeupIrq_MainEdma5Ch3   = MAIN_EDMA5_CH3_IRQn,     /*!< MAIN eDMA5 ch 3 IRQ (64) */
    kPOWER_WakeupIrq_MainEdma5Ch4   = MAIN_EDMA5_CH4_IRQn,     /*!< MAIN eDMA5 ch 4 IRQ (65) */
    kPOWER_WakeupIrq_MainEdma5Ch5   = MAIN_EDMA5_CH5_IRQn,     /*!< MAIN eDMA5 ch 5 IRQ (66) */
    kPOWER_WakeupIrq_MainEdma5Ch6   = MAIN_EDMA5_CH6_IRQn,     /*!< MAIN eDMA5 ch 6 IRQ (67) */
    kPOWER_WakeupIrq_MainEdma5Ch7   = MAIN_EDMA5_CH7_IRQn,     /*!< MAIN eDMA5 ch 7 IRQ (68) */
    kPOWER_WakeupIrq_MainEdma5Ch8   = MAIN_EDMA5_CH8_IRQn,     /*!< MAIN eDMA5 ch 8 IRQ (69) */
    kPOWER_WakeupIrq_MainEdma5Ch9   = MAIN_EDMA5_CH9_IRQn,     /*!< MAIN eDMA5 ch 9 IRQ (70) */
    kPOWER_WakeupIrq_MainEdma5Ch10  = MAIN_EDMA5_CH10_IRQn,    /*!< MAIN eDMA5 ch 10 IRQ (71) */
    kPOWER_WakeupIrq_MainEdma5Ch11  = MAIN_EDMA5_CH11_IRQn,    /*!< MAIN eDMA5 ch 11 IRQ (72) */
    kPOWER_WakeupIrq_MainEdma5Ch12  = MAIN_EDMA5_CH12_IRQn,    /*!< MAIN eDMA5 ch 12 IRQ (73) */
    kPOWER_WakeupIrq_MainEdma5Ch13  = MAIN_EDMA5_CH13_IRQn,    /*!< MAIN eDMA5 ch 13 IRQ (74) */
    kPOWER_WakeupIrq_MainEdma5Ch14  = MAIN_EDMA5_CH14_IRQn,    /*!< MAIN eDMA5 ch 14 IRQ (75) */
    kPOWER_WakeupIrq_MainEdma5Ch15  = MAIN_EDMA5_CH15_IRQn,    /*!< MAIN eDMA5 ch 15 IRQ (76) */
    kPOWER_WakeupIrq_MainFreqme     = MAIN_FREQME_IRQn,        /*!< MAIN FREQME (77) */
    kPOWER_WakeupIrq_HspStm         = HSP_STM_IRQn,            /*!< HSP STM (78) */
    kPOWER_WakeupIrq_MainXspi0      = MAIN_XSPI0_IRQn,         /*!< MAIN XSPI0 (82) */
    kPOWER_WakeupIrq_MainXspi1      = MAIN_XSPI1_IRQn,         /*!< MAIN XSPI1 (83) */
    kPOWER_WakeupIrq_SysconCguInt0  = SYSCON_CGU_INT0_IRQn,    /*!< SYSCON CGU Vdda0V8 (86) */
    kPOWER_WakeupIrq_SysconCguInt1  = SYSCON_CGU_INT1_IRQn,    /*!< SYSCON CGU AudioPLL (87) */
    kPOWER_WakeupIrq_SysconCguInt2  = SYSCON_CGU_INT2_IRQn,    /*!< SYSCON CGU VideoPLL (88) */
    kPOWER_WakeupIrq_MainCssi       = MAIN_CSSI_IRQn,          /*!< MAIN CSSI (89) */
    kPOWER_WakeupIrq_MainCssiMu0a   = MAIN_CSSI_SENTMU0A_IRQn, /*!< MAIN CSSI MU0A (90) */
    kPOWER_WakeupIrq_MainCssiMu1a   = MAIN_CSSI_SENTMU1A_IRQn, /*!< MAIN CSSI MU1A (91) */
    kPOWER_WakeupIrq_SysconPmuInt0  = SYSCON_PMU_INT0_IRQn,    /*!< SYSCON PMU sensor/monitor (93) */
    kPOWER_WakeupIrq_SysconPmuInt1  = SYSCON_PMU_INT1_IRQn,    /*!< SYSCON PMU body bias (94) */
    kPOWER_WakeupIrq_SysconResetcon = SYSCON_RESETCON_IRQn,    /*!< SYSCON RESETCON (95) */
    kPOWER_WakeupIrq_SysconFreqme   = SYSCON_FREQME_IRQn,      /*!< SYSCON FREQME (96) */

