zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_power.h
    /* ----------------------------------------------------------------
     * HSP domain IRQ wakeup sources - CMC0 IRQ_WAKEUP_MASK (IRQn 100-199)
     * HSP domain is powered off in Deep Sleep and deeper modes.
     * ---------------------------------------------------------------- */
    kPOWER_WakeupIrq_HspXbar0Ch0      = HSP_XBAR0_CH0_IRQn,       /*!< HSP XBAR0 ch 0 (100) */
    kPOWER_WakeupIrq_HspXbar0Ch1      = HSP_XBAR0_CH1_IRQn,       /*!< HSP XBAR0 ch 1 (101) */
    kPOWER_WakeupIrq_HspXbar0Ch2      = HSP_XBAR0_CH2_IRQn,       /*!< HSP XBAR0 ch 2 (102) */
    kPOWER_WakeupIrq_HspXbar0Ch3      = HSP_XBAR0_CH3_IRQn,       /*!< HSP XBAR0 ch 3 (103) */
    kPOWER_WakeupIrq_HspXbar0Ch4      = HSP_XBAR0_CH4_IRQn,       /*!< HSP XBAR0 ch 4 (104) */
    kPOWER_WakeupIrq_HspXbar0Ch5      = HSP_XBAR0_CH5_IRQn,       /*!< HSP XBAR0 ch 5 (105) */
    kPOWER_WakeupIrq_HspXbar0Ch6      = HSP_XBAR0_CH6_IRQn,       /*!< HSP XBAR0 ch 6 (106) */
    kPOWER_WakeupIrq_HspXbar0Ch7      = HSP_XBAR0_CH7_IRQn,       /*!< HSP XBAR0 ch 7 (107) */
    kPOWER_WakeupIrq_HspAdc0          = HSP_ADC0_IRQn,            /*!< HSP ADC0 (112) */
    kPOWER_WakeupIrq_HspAdc1          = HSP_ADC1_IRQn,            /*!< HSP ADC1 (113) */
    kPOWER_WakeupIrq_HspDac           = HSP_DAC_IRQn,             /*!< HSP DAC (114) */
    kPOWER_WakeupIrq_HspLpit0         = HSP_LPIT0_IRQn,           /*!< HSP LPIT0 (115) */
    kPOWER_WakeupIrq_HspLpit1         = HSP_LPIT1_IRQn,           /*!< HSP LPIT1 (116) */
    kPOWER_WakeupIrq_HspEflexPwm0Ch0  = HSP_EFLEXPWM0_CH0_IRQn,   /*!< HSP EFLEXPWM0 ch 0 (117) */
    kPOWER_WakeupIrq_HspEflexPwm0Ch1  = HSP_EFLEXPWM0_CH1_IRQn,   /*!< HSP EFLEXPWM0 ch 1 (118) */
    kPOWER_WakeupIrq_HspEflexPwm0Ch2  = HSP_EFLEXPWM0_CH2_IRQn,   /*!< HSP EFLEXPWM0 ch 2 (119) */
    kPOWER_WakeupIrq_HspEflexPwm0Ch3  = HSP_EFLEXPWM0_CH3_IRQn,   /*!< HSP EFLEXPWM0 ch 3 (120) */
    kPOWER_WakeupIrq_HspEflexPwm0Err  = HSP_EFLEXPWM0_ERROR_IRQn, /*!< HSP EFLEXPWM0 fault (121) */
    kPOWER_WakeupIrq_HspEflexPwm1Ch0  = HSP_EFLEXPWM1_CH0_IRQn,   /*!< HSP EFLEXPWM1 ch 0 (122) */
    kPOWER_WakeupIrq_HspEflexPwm1Ch1  = HSP_EFLEXPWM1_CH1_IRQn,   /*!< HSP EFLEXPWM1 ch 1 (123) */
    kPOWER_WakeupIrq_HspEflexPwm1Ch2  = HSP_EFLEXPWM1_CH2_IRQn,   /*!< HSP EFLEXPWM1 ch 2 (124) */
    kPOWER_WakeupIrq_HspEflexPwm1Ch3  = HSP_EFLEXPWM1_CH3_IRQn,   /*!< HSP EFLEXPWM1 ch 3 (125) */
    kPOWER_WakeupIrq_HspEflexPwm1Err  = HSP_EFLEXPWM1_ERROR_IRQn, /*!< HSP EFLEXPWM1 fault (126) */
    kPOWER_WakeupIrq_HspEflexPwm2Ch0  = HSP_EFLEXPWM2_CH0_IRQn,   /*!< HSP EFLEXPWM2 ch 0 (127) */
    kPOWER_WakeupIrq_HspEflexPwm2Ch1  = HSP_EFLEXPWM2_CH1_IRQn,   /*!< HSP EFLEXPWM2 ch 1 (128) */
    kPOWER_WakeupIrq_HspEflexPwm2Ch2  = HSP_EFLEXPWM2_CH2_IRQn,   /*!< HSP EFLEXPWM2 ch 2 (129) */
    kPOWER_WakeupIrq_HspEflexPwm2Ch3  = HSP_EFLEXPWM2_CH3_IRQn,   /*!< HSP EFLEXPWM2 ch 3 (130) */
    kPOWER_WakeupIrq_HspEflexPwm2Err  = HSP_EFLEXPWM2_ERROR_IRQn, /*!< HSP EFLEXPWM2 fault (131) */
    kPOWER_WakeupIrq_HspEflexPwm3Ch0  = HSP_EFLEXPWM3_CH0_IRQn,   /*!< HSP EFLEXPWM3 ch 0 (132) */
    kPOWER_WakeupIrq_HspEflexPwm3Ch1  = HSP_EFLEXPWM3_CH1_IRQn,   /*!< HSP EFLEXPWM3 ch 1 (133) */
    kPOWER_WakeupIrq_HspEflexPwm3Ch2  = HSP_EFLEXPWM3_CH2_IRQn,   /*!< HSP EFLEXPWM3 ch 2 (134) */
    kPOWER_WakeupIrq_HspEflexPwm3Ch3  = HSP_EFLEXPWM3_CH3_IRQn,   /*!< HSP EFLEXPWM3 ch 3 (135) */
    kPOWER_WakeupIrq_HspEflexPwm3Err  = HSP_EFLEXPWM3_ERROR_IRQn, /*!< HSP EFLEXPWM3 fault (136) */
    kPOWER_WakeupIrq_HspQtpm0Ch0      = HSP_QTPM0_IRQn,           /*!< HSP QTPM0 (137) */
    kPOWER_WakeupIrq_HspQtpm0Ch1      = HSP_QTPM1_IRQn,           /*!< HSP QTPM1 (138) */
    kPOWER_WakeupIrq_HspQtpm0Ch2      = HSP_QTPM2_IRQn,           /*!< HSP QTPM2 (139) */
    kPOWER_WakeupIrq_HspQtpm0Ch3      = HSP_QTPM3_IRQn,           /*!< HSP QTPM3 (140) */
    kPOWER_WakeupIrq_HspQtmr0         = HSP_QTMR0_IRQn,           /*!< HSP QTMR0 (149) */
    kPOWER_WakeupIrq_HspQtmr1         = HSP_QTMR1_IRQn,           /*!< HSP QTMR1 (150) */
    kPOWER_WakeupIrq_HspQtmr2         = HSP_QTMR2_IRQn,           /*!< HSP QTMR2 (151) */
    kPOWER_WakeupIrq_HspQtmr3         = HSP_QTMR3_IRQn,           /*!< HSP QTMR3 (152) */
    kPOWER_WakeupIrq_HspEqdc0         = HSP_EQDC0_IRQn,           /*!< HSP EQDC0 (153) */
    kPOWER_WakeupIrq_HspEqdc1         = HSP_EQDC1_IRQn,           /*!< HSP EQDC1 (154) */
    kPOWER_WakeupIrq_HspEqdc2         = HSP_EQDC2_IRQn,           /*!< HSP EQDC2 (155) */
    kPOWER_WakeupIrq_HspEqdc3         = HSP_EQDC3_IRQn,           /*!< HSP EQDC3 (156) */
    kPOWER_WakeupIrq_HspSinc0Ch0      = HSP_SINC0_CH0_IRQn,       /*!< HSP SINC0 ch 0 (157) */
    kPOWER_WakeupIrq_HspSinc0Ch1      = HSP_SINC0_CH1_IRQn,       /*!< HSP SINC0 ch 1 (158) */
    kPOWER_WakeupIrq_HspSinc0Ch2      = HSP_SINC0_CH2_IRQn,       /*!< HSP SINC0 ch 2 (159) */
    kPOWER_WakeupIrq_HspSinc0Ch3      = HSP_SINC0_CH3_IRQn,       /*!< HSP SINC0 ch 3 (160) */
    kPOWER_WakeupIrq_HspSinc1Ch0      = HSP_SINC1_CH0_IRQn,       /*!< HSP SINC1 ch 0 (161) */
    kPOWER_WakeupIrq_HspSinc1Ch1      = HSP_SINC1_CH1_IRQn,       /*!< HSP SINC1 ch 1 (162) */
    kPOWER_WakeupIrq_HspSinc1Ch2      = HSP_SINC1_CH2_IRQn,       /*!< HSP SINC1 ch 2 (163) */
    kPOWER_WakeupIrq_HspSinc1Ch3      = HSP_SINC1_CH3_IRQn,       /*!< HSP SINC1 ch 3 (164) */
    kPOWER_WakeupIrq_HspFlexCan0      = HSP_FLEXCAN0_IRQn,        /*!< HSP FlexCAN0 (165) */
    kPOWER_WakeupIrq_HspFlexCan0Error = HSP_FLEXCAN0_ERROR_IRQn,  /*!< HSP FlexCAN0 error (166) */
    kPOWER_WakeupIrq_HspFlexCan1      = HSP_FLEXCAN1_IRQn,        /*!< HSP FlexCAN1 (167) */
    kPOWER_WakeupIrq_HspFlexCan1Error = HSP_FLEXCAN1_ERROR_IRQn,  /*!< HSP FlexCAN1 error (168) */
    kPOWER_WakeupIrq_HspFlexCan2      = HSP_FLEXCAN2_IRQn,        /*!< HSP FlexCAN2 (169) */
    kPOWER_WakeupIrq_HspFlexCan2Error = HSP_FLEXCAN2_ERROR_IRQn,  /*!< HSP FlexCAN2 error (170) */
    kPOWER_WakeupIrq_HspFlexIo0       = HSP_FLEXIO0_IRQn,         /*!< HSP FlexIO0 (171) */
    kPOWER_WakeupIrq_HspFlexIo1       = HSP_FLEXIO1_IRQn,         /*!< HSP FlexIO1 (172) */
    kPOWER_WakeupIrq_HspFlexIo2       = HSP_FLEXIO2_IRQn,         /*!< HSP FlexIO2 (173) */
    kPOWER_WakeupIrq_HspI3c           = HSP_I3C_IRQn,             /*!< HSP I3C (174) */
    kPOWER_WakeupIrq_HspLpi2c0        = HSP_LPI2C0_IRQn,          /*!< HSP LPI2C0 (175) */
    kPOWER_WakeupIrq_HspLpi2c1        = HSP_LPI2C1_IRQn,          /*!< HSP LPI2C1 (176) */
    kPOWER_WakeupIrq_HspLpspi0        = HSP_LPSPI0_IRQn,          /*!< HSP LPSPI0 (179) */
    kPOWER_WakeupIrq_HspLpspi1        = HSP_LPSPI1_IRQn,          /*!< HSP LPSPI1 (180) */
    kPOWER_WakeupIrq_HspLpspi2        = HSP_LPSPI2_IRQn,          /*!< HSP LPSPI2 (181) */
    kPOWER_WakeupIrq_HspLpspi3        = HSP_LPSPI3_IRQn,          /*!< HSP LPSPI3 (182) */
    kPOWER_WakeupIrq_HspLpspi4        = HSP_LPSPI4_IRQn,          /*!< HSP LPSPI4 (183) */
    kPOWER_WakeupIrq_HspLpuart0       = HSP_LPUART0_IRQn,         /*!< HSP LPUART0 (184) */
    kPOWER_WakeupIrq_HspLpuart1       = HSP_LPUART1_IRQn,         /*!< HSP LPUART1 (185) */
    kPOWER_WakeupIrq_HspLpuart2       = HSP_LPUART2_IRQn,         /*!< HSP LPUART2 (186) */
    kPOWER_WakeupIrq_HspLpuart3       = HSP_LPUART3_IRQn,         /*!< HSP LPUART3 (187) */
    kPOWER_WakeupIrq_HspLpuart4       = HSP_LPUART4_IRQn,         /*!< HSP LPUART4 (188) */
    kPOWER_WakeupIrq_HspLpuart5       = HSP_LPUART5_IRQn,         /*!< HSP LPUART5 (189) */
    kPOWER_WakeupIrq_HspGpio0Ch0      = HSP_GPIO0_CH0_IRQn,       /*!< HSP GPIO0 ch 0 (190) */
    kPOWER_WakeupIrq_HspGpio0Ch1      = HSP_GPIO0_CH1_IRQn,       /*!< HSP GPIO0 ch 1 (191) */
    kPOWER_WakeupIrq_HspGpio1Ch0      = HSP_GPIO1_CH0_IRQn,       /*!< HSP GPIO1 ch 0 (192) */
    kPOWER_WakeupIrq_HspGpio1Ch1      = HSP_GPIO1_CH1_IRQn,       /*!< HSP GPIO1 ch 1 (193) */
    kPOWER_WakeupIrq_HspGpio2Ch0      = HSP_GPIO2_CH0_IRQn,       /*!< HSP GPIO2 ch 0 (194) */
    kPOWER_WakeupIrq_HspGpio2Ch1      = HSP_GPIO2_CH1_IRQn,       /*!< HSP GPIO2 ch 1 (195) */
    kPOWER_WakeupIrq_HspGpio3Ch0      = HSP_GPIO3_CH0_IRQn,       /*!< HSP GPIO3 ch 0 (196) */
    kPOWER_WakeupIrq_HspGpio3Ch1      = HSP_GPIO3_CH1_IRQn,       /*!< HSP GPIO3 ch 1 (197) */
    kPOWER_WakeupIrq_HspGpio4Ch0      = HSP_GPIO4_CH0_IRQn,       /*!< HSP GPIO4 ch 0 (198) */
    kPOWER_WakeupIrq_HspGpio4Ch1      = HSP_GPIO4_CH1_IRQn,       /*!< HSP GPIO4 ch 1 (199) */

    /* ----------------------------------------------------------------
     * WAKE domain IRQ wakeup sources - CMC0 IRQ_WAKEUP_MASK (IRQn 205-245)
     * PD_WAKE stays powered through Sleep, Deep Sleep, and Power Down.
     * ---------------------------------------------------------------- */
    kPOWER_WakeupIrq_WakeTrdc    = WAKE_TRDC_IRQn,     /*!< WAKE TRDC (205) */
    kPOWER_WakeupIrq_WakeXbarCh0 = WAKE_XBAR_CH0_IRQn, /*!< WAKE XBAR ch 0 (206) */
    kPOWER_WakeupIrq_WakeXbarCh1 = WAKE_XBAR_CH1_IRQn, /*!< WAKE XBAR ch 1 (207) */
    /* WAKE eDMA3 channel-completion IRQ wakeup (use DMA variant for request-level wakeup) */
    kPOWER_WakeupIrq_WakeEdma3Ch0      = WAKE_EDMA3_CH0_IRQn,       /*!< WAKE eDMA3 ch 0 IRQ (208) */
    kPOWER_WakeupIrq_WakeEdma3Ch1      = WAKE_EDMA3_CH1_IRQn,       /*!< WAKE eDMA3 ch 1 IRQ (209) */
    kPOWER_WakeupIrq_WakeEdma3Ch2      = WAKE_EDMA3_CH2_IRQn,       /*!< WAKE eDMA3 ch 2 IRQ (210) */
    kPOWER_WakeupIrq_WakeEdma3Ch3      = WAKE_EDMA3_CH3_IRQn,       /*!< WAKE eDMA3 ch 3 IRQ (211) */
    kPOWER_WakeupIrq_WakeEdma3Ch4      = WAKE_EDMA3_CH4_IRQn,       /*!< WAKE eDMA3 ch 4 IRQ (212) */
    kPOWER_WakeupIrq_WakeEdma3Ch5      = WAKE_EDMA3_CH5_IRQn,       /*!< WAKE eDMA3 ch 5 IRQ (213) */
    kPOWER_WakeupIrq_WakeEdma3Ch6      = WAKE_EDMA3_CH6_IRQn,       /*!< WAKE eDMA3 ch 6 IRQ (214) */
    kPOWER_WakeupIrq_WakeEdma3Ch7      = WAKE_EDMA3_CH7_IRQn,       /*!< WAKE eDMA3 ch 7 IRQ (215) */
    kPOWER_WakeupIrq_WakeAcmp0         = WAKE_ACMP0_IRQn,           /*!< WAKE CMP0 (216) */
    kPOWER_WakeupIrq_WakeAcmp1         = WAKE_ACMP1_IRQn,           /*!< WAKE CMP1 (217) */
    kPOWER_WakeupIrq_WakeAcmp2         = WAKE_ACMP2_IRQn,           /*!< WAKE CMP2 (218) */
    kPOWER_WakeupIrq_WakeAcmp3         = WAKE_ACMP3_IRQn,           /*!< WAKE CMP3 (219) */
    kPOWER_WakeupIrq_WakeEwm           = WAKE_EWM_IRQn,             /*!< WAKE EWM watchdog (220) */
    kPOWER_WakeupIrq_WakeFreqme        = WAKE_FREQME_IRQn,          /*!< WAKE FREQME (221) */
    kPOWER_WakeupIrq_WakeLptmr0        = WAKE_LPTMR0_IRQn,          /*!< WAKE LPTMR0 (222) */
    kPOWER_WakeupIrq_WakeLptmr1        = WAKE_LPTMR1_IRQn,          /*!< WAKE LPTMR1 (223) */
    kPOWER_WakeupIrq_WakeQtpmCh0       = WAKE_QTPM0_IRQn,           /*!< WAKE QTPM0 (224) */
    kPOWER_WakeupIrq_WakeQtpmCh1       = WAKE_QTPM1_IRQn,           /*!< WAKE QTPM1 (225) */
    kPOWER_WakeupIrq_WakeQtpmCh2       = WAKE_QTPM2_IRQn,           /*!< WAKE QTPM2 (226) */
    kPOWER_WakeupIrq_WakeQtpmCh3       = WAKE_QTPM3_IRQn,           /*!< WAKE QTPM3 (227) */
    kPOWER_WakeupIrq_WakeSwt0          = WAKE_SWT0_IRQn,            /*!< WAKE SWT0 (228) */
    kPOWER_WakeupIrq_WakeSwt1          = WAKE_SWT1_IRQn,            /*!< WAKE SWT1 (229) */
    kPOWER_WakeupIrq_WakeI3c           = WAKE_I3C_IRQn,             /*!< WAKE I3C (234) */
    kPOWER_WakeupIrq_WakeLpi2c0        = WAKE_LPI2C0_IRQn,          /*!< WAKE LPI2C0 (235) */
    kPOWER_WakeupIrq_WakeLpi2c1        = WAKE_LPI2C1_IRQn,          /*!< WAKE LPI2C1 (236) */
    kPOWER_WakeupIrq_WakeLpspi         = WAKE_LPSPI_IRQn,           /*!< WAKE LPSPI (237) */
    kPOWER_WakeupIrq_WakeLpuart0       = WAKE_LPUART0_IRQn,         /*!< WAKE LPUART0 (238) */
    kPOWER_WakeupIrq_WakeLpuart1       = WAKE_LPUART1_IRQn,         /*!< WAKE LPUART1 (239) */
    kPOWER_WakeupIrq_WakeGpioCh0       = WAKE_GPIO_CH0_IRQn,        /*!< WAKE GPIO ch 0 (240) */
    kPOWER_WakeupIrq_WakeGpioCh1       = WAKE_GPIO_CH1_IRQn,        /*!< WAKE GPIO ch 1 (241) */
    kPOWER_WakeupIrq_WakePdmEvent      = WAKE_PDM_EVENT_IRQn,       /*!< WAKE MICFIL FIFO event (242) */
    kPOWER_WakeupIrq_WakePdmError      = WAKE_PDM_ERROR_IRQn,       /*!< WAKE MICFIL error (243) */
    kPOWER_WakeupIrq_WakePdmHwvadEvent = WAKE_PDM_HWVAD_EVENT_IRQn, /*!< WAKE MICFIL HWVAD event (244) */
    kPOWER_WakeupIrq_WakePdmHwvadError = WAKE_PDM_HWVAD_ERROR_IRQn, /*!< WAKE MICFIL HWVAD error (245) */

    /* ----------------------------------------------------------------
     * VBAT domain IRQ wakeup sources - CMC0 IRQ_WAKEUP_MASK (IRQn 247-254)
     * PD_BAT/VBAT stays powered in all modes including Deep Power Down.
     * ---------------------------------------------------------------- */
    kPOWER_WakeupIrq_VbatBbsmInt0 = VBAT_BBSM_INT0_IRQn, /*!< VBAT BBSM alarm 0 (247) */
    kPOWER_WakeupIrq_VbatTdet     = VBAT_TDET_IRQn,      /*!< VBAT tamper detect (249) */
    kPOWER_WakeupIrq_VbatLptmr    = VBAT_LPTMR_IRQn,     /*!< VBAT LPTMR (250) */
    kPOWER_WakeupIrq_VbatRtc      = VBAT_RTC_IRQn,       /*!< VBAT RTC (251) */
    kPOWER_WakeupIrq_VbatGpioCh0  = VBAT_GPIO_CH0_IRQn,  /*!< VBAT GPIO ch 0 / AON pad (252) */
    kPOWER_WakeupIrq_VbatGpioCh1  = VBAT_GPIO_CH1_IRQn,  /*!< VBAT GPIO ch 1 / AON pad (253) */
    kPOWER_WakeupIrq_VbatVbatcon  = VBAT_VBATCON_IRQn,   /*!< VBAT VBATCON (254) */

    /* ----------------------------------------------------------------
     * AUDIO domain IRQ wakeup sources - CMC0 IRQ_WAKEUP_MASK (IRQn 255-289)
     * Part of PD_MAIN; powered in Sleep and Deep Sleep.
     * ---------------------------------------------------------------- */
    kPOWER_WakeupIrq_AudioTrdc     = AUDIO_TRDC_IRQn,      /*!< AUDIO TRDC (255) */
    kPOWER_WakeupIrq_AudioSai0     = AUDIO_SAI0_IRQn,      /*!< AUDIO SAI0 (256) */
    kPOWER_WakeupIrq_AudioSai1     = AUDIO_SAI1_IRQn,      /*!< AUDIO SAI1 (257) */
    kPOWER_WakeupIrq_AudioSai2     = AUDIO_SAI2_IRQn,      /*!< AUDIO SAI2 (258) */
    kPOWER_WakeupIrq_AudioPdmEvent = AUDIO_PDM_EVENT_IRQn, /*!< AUDIO MICFIL FIFO event (262) */
    kPOWER_WakeupIrq_AudioPdmError = AUDIO_PDM_ERROR_IRQn, /*!< AUDIO MICFIL error (263) */
    kPOWER_WakeupIrq_AudioSpdif    = AUDIO_SPDIF_IRQn,     /*!< AUDIO SPDIF (270) */
    kPOWER_WakeupIrq_AudioEdma3Ch0 = AUDIO_EDMA3_CH0_IRQn, /*!< AUDIO eDMA3 ch 0 IRQ (271) */
    kPOWER_WakeupIrq_AudioEdma3Ch1 = AUDIO_EDMA3_CH1_IRQn, /*!< AUDIO eDMA3 ch 1 IRQ (272) */
    kPOWER_WakeupIrq_AudioEdma3Ch2 = AUDIO_EDMA3_CH2_IRQn, /*!< AUDIO eDMA3 ch 2 IRQ (273) */
    kPOWER_WakeupIrq_AudioEdma3Ch3 = AUDIO_EDMA3_CH3_IRQn, /*!< AUDIO eDMA3 ch 3 IRQ (274) */
    kPOWER_WakeupIrq_AudioEdma3Ch4 = AUDIO_EDMA3_CH4_IRQn, /*!< AUDIO eDMA3 ch 4 IRQ (275) */
    kPOWER_WakeupIrq_AudioEdma3Ch5 = AUDIO_EDMA3_CH5_IRQn, /*!< AUDIO eDMA3 ch 5 IRQ (276) */
    kPOWER_WakeupIrq_AudioEdma3Ch6 = AUDIO_EDMA3_CH6_IRQn, /*!< AUDIO eDMA3 ch 6 IRQ (277) */
    kPOWER_WakeupIrq_AudioEdma3Ch7 = AUDIO_EDMA3_CH7_IRQn, /*!< AUDIO eDMA3 ch 7 IRQ (278) */
    kPOWER_WakeupIrq_AudioAsrc     = AUDIO_ASRC_IRQn,      /*!< AUDIO ASRC (288) */
    kPOWER_WakeupIrq_AudioFreqme   = AUDIO_FREQME_IRQn,    /*!< AUDIO FREQME (289) */

    /* ----------------------------------------------------------------
     * COMM domain IRQ wakeup sources - CMC0 IRQ_WAKEUP_MASK (IRQn 295-314)
     * PD_COMM powered in Sleep and Deep Sleep.
     * ---------------------------------------------------------------- */
    kPOWER_WakeupIrq_CommTrdc         = COMM_TRDC_IRQn,          /*!< COMM TRDC (295) */
    kPOWER_WakeupIrq_CommEnetQos      = COMM_ENET_QOS_IRQn,      /*!< COMM ENET_QOS (296) */
    kPOWER_WakeupIrq_CommEnetQosTx    = COMM_ENET_QOS_TX_IRQn,   /*!< COMM ENET_QOS TX per-ch (297) */
    kPOWER_WakeupIrq_CommEnetQosRx    = COMM_ENET_QOS_RX_IRQn,   /*!< COMM ENET_QOS RX per-ch (298) */
    kPOWER_WakeupIrq_CommEnetTx       = COMM_ENET_TX_IRQn,       /*!< COMM ENET TX (299) */
    kPOWER_WakeupIrq_CommEnetRx       = COMM_ENET_RX_IRQn,       /*!< COMM ENET RX (300) */
    kPOWER_WakeupIrq_CommEnetOther    = COMM_ENET_OTHER_IRQn,    /*!< COMM ENET other (301) */
    kPOWER_WakeupIrq_CommEnet1588     = COMM_ENET_1588_IRQn,     /*!< COMM ENET 1588 timer (302) */
    kPOWER_WakeupIrq_CommFlexspiSlv   = COMM_FLEXSPI_SLV_IRQn,   /*!< COMM FlexSPI follower (303) */
    kPOWER_WakeupIrq_CommUsb0         = COMM_USB0_IRQn,          /*!< COMM USB0 (304) */
    kPOWER_WakeupIrq_CommUsbPhy       = COMM_USBPHY_IRQn,        /*!< COMM USBPHY (305) */
    kPOWER_WakeupIrq_CommUsb1         = COMM_USB1_IRQn,          /*!< COMM USB1 (306) */
    kPOWER_WakeupIrq_CommUsdhc0       = COMM_USDHC0_IRQn,        /*!< COMM uSDHC0 (307) */
    kPOWER_WakeupIrq_CommUsdhc1       = COMM_USDHC1_IRQn,        /*!< COMM uSDHC1 (308) */
    kPOWER_WakeupIrq_CommTenbaseTphy0 = COMM_TENBASET_PHY0_IRQn, /*!< COMM 10BASE-T PHY0 (310) */
    kPOWER_WakeupIrq_CommTenbaseTphy1 = COMM_TENBASET_PHY1_IRQn, /*!< COMM 10BASE-T PHY1 (312) */
    kPOWER_WakeupIrq_CommFreqme       = COMM_FREQME_IRQn,        /*!< COMM FREQME (314) */

    /* ----------------------------------------------------------------
     * MEDIA domain IRQ wakeup sources - CMC0 IRQ_WAKEUP_MASK (IRQn 315-333)
     * PD_MEDIA powered in Sleep and Deep Sleep.
     * ---------------------------------------------------------------- */
    kPOWER_WakeupIrq_MediaTrdc        = MEDIA_TRDC_IRQn,        /*!< MEDIA TRDC (315) */
    kPOWER_WakeupIrq_MediaDcifCh0     = MEDIA_DCIF_CH0_IRQn,    /*!< MEDIA DCIF ch 0 (317) */
    kPOWER_WakeupIrq_MediaDcifCh1     = MEDIA_DCIF_CH1_IRQn,    /*!< MEDIA DCIF ch 1 (318) */
    kPOWER_WakeupIrq_MediaDcifCh2     = MEDIA_DCIF_CH2_IRQn,    /*!< MEDIA DCIF ch 2 (319) */
    kPOWER_WakeupIrq_MediaDcifCh3     = MEDIA_DCIF_CH3_IRQn,    /*!< MEDIA DCIF ch 3 (320) */
    kPOWER_WakeupIrq_MediaDcifCh4     = MEDIA_DCIF_CH4_IRQn,    /*!< MEDIA DCIF ch 4 (321) */
    kPOWER_WakeupIrq_MediaDcifCh5     = MEDIA_DCIF_CH5_IRQn,    /*!< MEDIA DCIF ch 5 (322) */
    kPOWER_WakeupIrq_MediaDcifCh6     = MEDIA_DCIF_CH6_IRQn,    /*!< MEDIA DCIF ch 6 (323) */
    kPOWER_WakeupIrq_MediaDcifCh7     = MEDIA_DCIF_CH7_IRQn,    /*!< MEDIA DCIF ch 7 (324) */
    kPOWER_WakeupIrq_MediaDcifCh8     = MEDIA_DCIF_CH8_IRQn,    /*!< MEDIA DCIF ch 8 (325) */
    kPOWER_WakeupIrq_MediaCsi         = MEDIA_CSI_IRQn,         /*!< MEDIA CSI (326) */
    kPOWER_WakeupIrq_MediaReformatter = MEDIA_REFORMATTER_IRQn, /*!< MEDIA Reformatter (327) */
    kPOWER_WakeupIrq_MediaIsi         = MEDIA_ISI_IRQn,         /*!< MEDIA ISI (328) */
    kPOWER_WakeupIrq_MediaTingpu      = MEDIA_TINGPU_IRQn,      /*!< MEDIA TinyGPU (329) */
    kPOWER_WakeupIrq_MediaJpegDec     = MEDIA_JPEGDEC_IRQn,     /*!< MEDIA JPEG decoder (330) */
    kPOWER_WakeupIrq_MediaMipiCsi     = MEDIA_MIPI_CSI_IRQn,    /*!< MEDIA MIPI CSI (331) */
    kPOWER_WakeupIrq_MediaMipiDsi     = MEDIA_MIPI_DSI_IRQn,    /*!< MEDIA MIPI DSI (332) */
    kPOWER_WakeupIrq_MediaFreqme      = MEDIA_FREQME_IRQn,      /*!< MEDIA FREQME (333) */

    /* ----------------------------------------------------------------
     * MAIN domain DMA wakeup sources - CMC1 DMA_WAKEUP_MASK
     * Triggered by a DMA transfer request (before the channel-completion IRQ).
     * Index = RM DMA wakeup source index (Chapter 4 Tables 16/17/18) - NOT an eDMA channel.
     * AUDIO_EDMA3 requests also route through CMC1 (indices 44-48).
     * Index 0-31 -> CMC1 DMA_WAKEUP_MASK_0; index 32-63 -> CMC1 DMA_WAKEUP_MASK_1.
     * ---------------------------------------------------------------- */
    /* Table 16 - MAIN_EDMA5 (HSP_ADC_0/1 and DAC) */
    kPOWER_WakeupMainDma_Adc0 = (0x10000000 | 0), /*!< HSP_ADC_0 FIFO0+1 (index 0) */
    kPOWER_WakeupMainDma_Adc1 = (0x10000000 | 1), /*!< HSP_ADC_1 FIFO0+1 (index 1) */
    kPOWER_WakeupMainDma_Dac  = (0x10000000 | 2), /*!< HSP_DAC (index 2) */
    /* Table 17 - MAIN_EDMA3 (HSP peripherals) */
    kPOWER_WakeupMainDma_Qtpm0   = (0x10000000 | 3),  /*!< HSP_QTPM_0 (index 3) */
    kPOWER_WakeupMainDma_FlexIo0 = (0x10000000 | 6),  /*!< HSP_FLEXIO_0 (index 6) */
    kPOWER_WakeupMainDma_FlexIo1 = (0x10000000 | 7),  /*!< HSP_FLEXIO_1 (index 7) */
    kPOWER_WakeupMainDma_FlexIo2 = (0x10000000 | 8),  /*!< HSP_FLEXIO_2 (index 8) */
    kPOWER_WakeupMainDma_Lpi2c0  = (0x10000000 | 9),  /*!< HSP_LPI2C_0 (index 9) */
    kPOWER_WakeupMainDma_Lpi2c1  = (0x10000000 | 10), /*!< HSP_LPI2C_1 (index 10) */
    kPOWER_WakeupMainDma_Lpspi0  = (0x10000000 | 13), /*!< HSP_LPSPI_0 (index 13) */
    kPOWER_WakeupMainDma_Lpspi1  = (0x10000000 | 14), /*!< HSP_LPSPI_1 (index 14) */
    kPOWER_WakeupMainDma_Lpspi2  = (0x10000000 | 15), /*!< HSP_LPSPI_2 (index 15) */
    kPOWER_WakeupMainDma_Lpspi3  = (0x10000000 | 16), /*!< HSP_LPSPI_3 (index 16) */
    kPOWER_WakeupMainDma_Lpspi4  = (0x10000000 | 17), /*!< HSP_LPSPI_4 (index 17) */
    kPOWER_WakeupMainDma_Lpuart0 = (0x10000000 | 18), /*!< HSP_LPUART_0 (index 18) */
    kPOWER_WakeupMainDma_Lpuart1 = (0x10000000 | 19), /*!< HSP_LPUART_1 (index 19) */
    kPOWER_WakeupMainDma_Lpuart2 = (0x10000000 | 20), /*!< HSP_LPUART_2 (index 20) */
    kPOWER_WakeupMainDma_Lpuart3 = (0x10000000 | 21), /*!< HSP_LPUART_3 (index 21) */
    kPOWER_WakeupMainDma_Lpuart4 = (0x10000000 | 22), /*!< HSP_LPUART_4 (index 22) */
    kPOWER_WakeupMainDma_Lpuart5 = (0x10000000 | 23), /*!< HSP_LPUART_5 (index 23) */
    kPOWER_WakeupMainDma_Gpio0   = (0x10000000 | 24), /*!< HSP_GPIO_0 (index 24) */
    kPOWER_WakeupMainDma_Gpio1   = (0x10000000 | 25), /*!< HSP_GPIO_1 (index 25) */
    kPOWER_WakeupMainDma_Gpio2   = (0x10000000 | 26), /*!< HSP_GPIO_2 (index 26) */
    kPOWER_WakeupMainDma_Gpio3   = (0x10000000 | 27), /*!< HSP_GPIO_3 (index 27) */
    kPOWER_WakeupMainDma_Gpio4   = (0x10000000 | 28), /*!< HSP_GPIO_4 (index 28) */
    /* Table 18 - AUDIO_EDMA3 (routes through CMC1) */
    kPOWER_WakeupMainDma_AudioMicfil = (0x10000000 | 44), /*!< AUDIO_MICFIL (index 44) */
    kPOWER_WakeupMainDma_AudioSai0   = (0x10000000 | 46), /*!< AUDIO_SAI_0 (index 46) */
    kPOWER_WakeupMainDma_AudioSai1   = (0x10000000 | 47), /*!< AUDIO_SAI_1 (index 47) */
    kPOWER_WakeupMainDma_AudioSai2   = (0x10000000 | 48), /*!< AUDIO_SAI_2 (index 48) */

    /* ----------------------------------------------------------------
     * WAKE domain DMA wakeup sources - CMC2 DMA_WAKEUP_MASK
     * Triggered by a DMA transfer request on WAKE_EDMA3 (before completion IRQ).
     * Index = RM DMA wakeup source index (Chapter 4 Table 19) - NOT an eDMA channel.
     * Index 31    -> CMC2 DMA_WAKEUP_MASK_0 bit 31.
     * Index 32-43 -> CMC2 DMA_WAKEUP_MASK_1 bits 0-11.
     * ---------------------------------------------------------------- */
    kPOWER_WakeupWakeDma_Lptmr0    = (0x20000000 | 31), /*!< WAKE_LPTMR_0 (index 31) */
    kPOWER_WakeupWakeDma_Lptmr1    = (0x20000000 | 32), /*!< WAKE_LPTMR_1 (index 32) */
    kPOWER_WakeupWakeDma_Qtpm      = (0x20000000 | 33), /*!< WAKE_QTPM (index 33) */
    kPOWER_WakeupWakeDma_Lpi2c0    = (0x20000000 | 34), /*!< WAKE_LPI2C_0 (index 34) */
    kPOWER_WakeupWakeDma_Lpi2c1    = (0x20000000 | 35), /*!< WAKE_LPI2C_1 (index 35) */
    kPOWER_WakeupWakeDma_Lpspi     = (0x20000000 | 36), /*!< WAKE_LPSPI (index 36) */
    kPOWER_WakeupWakeDma_Lpuart0   = (0x20000000 | 37), /*!< WAKE_LPUART_0 (index 37) */
    kPOWER_WakeupWakeDma_Lpuart1   = (0x20000000 | 38), /*!< WAKE_LPUART_1 (index 38) */
    kPOWER_WakeupWakeDma_Gpio      = (0x20000000 | 39), /*!< WAKE_GPIO (index 39) */
    kPOWER_WakeupWakeDma_Micfil    = (0x20000000 | 40), /*!< WAKE_MICFIL (index 40) */
    kPOWER_WakeupWakeDma_VbatLptmr = (0x20000000 | 42), /*!< VBAT_LPTMR (index 42) */
    kPOWER_WakeupWakeDma_VbatGpio  = (0x20000000 | 43), /*!< VBAT_GPIO (index 43) */
} power_wakeup_source_t;

/*!
 * @brief Run-mode regulator configuration bundle.
 */
typedef struct _power_run_regulators_config
{
    pmu_dcdc_config_t dcdc;
    pmu_ldo_vdd0v8_config_t ldo0V8;
    pmu_ldo_vdd1v8_config_t ldo1V8;
    pmu_ldo_vdda1v8_config_t ldoVdda;
    pmu_vdd_pmu_config_t vddPmu;
} power_run_regulators_config_t;

