zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_power.h
/*!
 * @brief RT2660 memory identifiers for MEMCON active-mode control.
 *
 * Encodes (sliceIndex << 8) | blockIndex.  Slice 0-11 map to
 * SYSCON__MEMCON_S0–S11.
 */
typedef enum _power_memory
{
    /* WAKE_SS */
    kPOWER_Mem_WakeSram        = (0U << 8U) | 0U, /*!< WAKE_SS SRAM (S0 B0) */
    kPOWER_Mem_WakeEdma3TcdRam = (1U << 8U) | 0U, /*!< WAKE eDMA3 TCD / MICFIL FIR (S1 B0) */

    /* COMPUTE_SS */
    kPOWER_Mem_ComputeSram01  = (2U << 8U) | 0U, /*!< SRAMCTL_0 Mem 0/1 (S2 B0) */
    kPOWER_Mem_ComputeSram23  = (2U << 8U) | 1U, /*!< SRAMCTL_0 Mem 2/3 (S2 B1) */
    kPOWER_Mem_ComputeSram4   = (2U << 8U) | 2U, /*!< SRAMCTL_0 Mem 4   (S2 B2) */
    kPOWER_Mem_ComputeSram5   = (2U << 8U) | 3U, /*!< SRAMCTL_0 Mem 5   (S2 B3) */
    kPOWER_Mem_ComputeSram6   = (2U << 8U) | 4U, /*!< SRAMCTL_1 Mem 0   (S2 B4) */
    kPOWER_Mem_ComputeSram7   = (2U << 8U) | 5U, /*!< SRAMCTL_1 Mem 1   (S2 B5) */
    kPOWER_Mem_ComputeSram8   = (2U << 8U) | 6U, /*!< SRAMCTL_2 Mem 0   (S2 B6) */
    kPOWER_Mem_ComputeSram9   = (2U << 8U) | 7U, /*!< SRAMCTL_2 Mem 1   (S2 B7) */
    kPOWER_Mem_LlcCacheBuffer = (2U << 8U) | 8U, /*!< LLC Cache buffer  (S2 B8) */
    /* S2 B9 - unused/reserved */
    kPOWER_Mem_Audio8Kb = (2U << 8U) | 10U, /*!< Audio SRAM 8KB    (S2 B10) */
    /* S2 B11 = PKC MEM, accessed via power_down_config_t.retainPkcMem only */

    /* M85 CPU (PD_CPU) */
    kPOWER_Mem_CpuICache     = (4U << 8U) | 0U, /*!< M85 I-Cache (S4 B0) */
    kPOWER_Mem_CpuDCacheData = (4U << 8U) | 1U, /*!< M85 D-Cache data (S4 B1) */
    kPOWER_Mem_CpuITCM       = (4U << 8U) | 2U, /*!< M85 ITCM (S4 B2) */
    kPOWER_Mem_CpuDTCM       = (4U << 8U) | 3U, /*!< M85 DTCM (S4 B3) */
    kPOWER_Mem_CpuDCacheTag  = (5U << 8U) | 0U, /*!< M85 D-Cache tag (S5 B0) */

    /* NPU (PD_NPU) */
    kPOWER_Mem_NpuWeightCache   = (6U << 8U) | 0U, /*!< NPU weight cache (S6 B0) */
    kPOWER_Mem_NpuResultBuffers = (7U << 8U) | 0U, /*!< NPU result buffers (S7 B0) */

    /* MEDIA_SS (PD_MEDIA) */
    kPOWER_Mem_MediaShared = (9U << 8U) | 0U, /*!< MEDIA_SS shared (S9 B0) */

    /* COMM_SS (PD_COMM) */
    kPOWER_Mem_CommShared = (10U << 8U) | 0U, /*!< COMM_SS ENET/ENET_QOS (S10 B0) */
    kPOWER_Mem_CommType2  = (11U << 8U) | 0U, /*!< COMM_SS uSDHC/USBHS/ENET (S11 B0) */
} power_memory_t;

/*!
 * @brief RT2660 subsystem root clock identifier.
 *
 * Each value is the bit index within POWERCON_SOC_CTRL.RCGCFG_ACTIVE.
 * Polarity: clearing a bit enables the root clock; setting it disables (gates) it.
 * Note: NPU has no separate RCGCFG_ACTIVE bit. The NPU lives inside the Compute
 * subsystem (CMPT_SS) and is gated by the COMPUTE_SS root clock (bit 0), shared
 * with CM85. Clock and power are not 1:1: bit 0 clocks both CM85 (PD_CPU) and
 * NPU (PD_NPU), which remain independent PDCON power domains.
 */
typedef enum _power_root_clock
{
    kPOWER_RootClock_COMPUTE_SS   = 0U, /*!< Compute subsystem (CMPT_SS): CM85 + NPU root clock - bit 0 */
    kPOWER_RootClock_MAIN_SS      = 1U, /*!< Main subsystem root clock - bit 1 */
    kPOWER_RootClock_WAKE_SS      = 2U, /*!< Wake subsystem root clock - bit 2 */
    kPOWER_RootClock_COMM_SS      = 3U, /*!< Communication subsystem root clock - bit 3 */
    kPOWER_RootClock_MEDIA_SS     = 4U, /*!< Media subsystem root clock - bit 4 */
    kPOWER_RootClock_AUDIO_SS     = 5U, /*!< Audio subsystem root clock - bit 5 */
    kPOWER_RootClock_WAKE_SS_1MHz = 6U, /*!< Wake subsystem 1 MHz root clock - bit 6 */
    kPOWER_RootClock_WAKE_SS_2MHz = 7U, /*!< Wake subsystem 2 MHz root clock - bit 7 */
} power_root_clock_t;

/*!
 * @brief RT2660 clock source identifier.
 *
 * Each value is the bit index within POWERCON_SOC_CTRL.CSRCCFG_ACTIVE.
 * Polarity: 0b = disable, 1b = enable (active-high, unlike RCGCFG_ACTIVE).
 * Modifying CSRCCFG_ACTIVE requires a P-Channel trigger (POWERCON_TriggerSocUpdate).
 */
typedef enum _power_clock_source
{
    kPOWER_ClockSource_LDOA_0V8  = 0U, /*!< LDOA 0.8 V supply enable - bit 0 */
    kPOWER_ClockSource_FRO192M   = 1U, /*!< Internal 192 MHz FRO - bit 1 */
    kPOWER_ClockSource_FRO12M    = 2U, /*!< Internal 12 MHz FRO - bit 2 */
    kPOWER_ClockSource_MAINPLL   = 3U, /*!< Main PLL - bit 3 */
    kPOWER_ClockSource_COREPLL   = 4U, /*!< Core PLL - bit 4 */
    kPOWER_ClockSource_SYSPLL    = 5U, /*!< System PLL - bit 5 */
    kPOWER_ClockSource_LDOQ_0V8  = 6U, /*!< LDOQ 0.8 V supply enable - bit 6 */
    kPOWER_ClockSource_SXOSC     = 7U, /*!< External crystal oscillator - bit 7 */
    kPOWER_ClockSource_FRO12M_LP = 8U, /*!< Low-power 12 MHz FRO (wake) - bit 8 */
} power_clock_source_t;

/*! @brief Callback type for run-mode clock frequency changes. */
typedef void (*power_clock_cb_t)(void);

/*!
 * @brief Active run mode, classified from the CPU core clock frequency.
 *
 * Returned by @ref POWER_GetCurrentRunMode.  The PMU pmuMode field cannot
 * distinguish HP from Normal run (both use pmuMode=0), so the run mode is
 * detected from the CGU MAIN root clock frequency instead.
 */
typedef enum _power_run_mode
{
    kPOWER_RunModeHp     = 0U, /*!< Over Drive Run    (~1 GHz,  FBB, 0.9 V). */
    kPOWER_RunModeNormal = 1U, /*!< Normal Drive Run  (~800 MHz, FBB, 0.8 V). */
    kPOWER_RunModeLp     = 2U, /*!< Low Performance Run (~600 MHz, ZBB, 0.8 V). */
} power_run_mode_t;

/*!
 * @brief RT2660 software-controllable power domain identifiers.
 *
 * These map directly to PDCON domain indices.  Only these four domains
 * are SW-triggerable on RT2660.
 */
typedef enum _power_domain
{
    kPOWER_DomainWake  = 0U, /*!< PD_WAKE - wake subsystem */
    kPOWER_DomainMain  = 1U, /*!< PD_MAIN - main subsystem */
    kPOWER_DomainCpu   = 2U, /*!< PD_CPU - M85 compute domain */
    kPOWER_DomainNpu   = 3U, /*!< PD_NPU - neural processing unit */
    kPOWER_DomainMedia = 4U, /*!< PD_MEDIA - media subsystem */
    kPOWER_DomainComm  = 5U, /*!< PD_COMM - communication subsystem */
} power_domain_t;

/*!
 * @brief Sleep config.
 *
 * Wakeup sources are configured separately via POWER_EnableWakeupSource().
 * PD_MAIN, PD_WAKE, PD_BAT always ON.  PMU stays in HP mode (same voltage as
 * the preceding run mode, FBB disabled for Sleep entry).
 *
 * Fields marked [EXPERIMENTAL] may be removed or renamed in a future release.
 */
typedef struct _power_sleep_config
{
    /* Power domain events (PDCON.PDSLPCFG).
     * RT2660 does not integrate PDCON domain retention (omitted for die size), so the only
     * valid values are kPDCON_EventNoneOrActive (On) and kPDCON_EventPowerOff.
     * kPDCON_EventRetention must not be used on RT2660. */
    pdcon_event_t setCpuDomainEvent;   /*!< PD_CPU:   On (NoneOrActive) or PowerOff */
    pdcon_event_t setNpuDomainEvent;   /*!< PD_NPU:   On (NoneOrActive) or PowerOff */
    pdcon_event_t setCommDomainEvent;  /*!< PD_COMM:  On (NoneOrActive) or PowerOff */
    pdcon_event_t setMediaDomainEvent; /*!< PD_MEDIA: On (NoneOrActive) or PowerOff */

    /* [EXPERIMENTAL] PMU analog state written to POWERCON_SOC_CTRL.PMUCFG_STBY.
     * In Sleep the SSC P-Channel is not triggered, so these do not cause actual
     * PMU analog transitions.  Defaults match the preceding PMUCFG_ACTIVE value. */
    uint8_t setPmuMode;           /*!< [EXPERIMENTAL] PMU mode bits[22:20]: 0=HP, 2=LP, 3=RET */
    pmu_dcdc_mode_t setDcdcMode;  /*!< [EXPERIMENTAL] DCDC mode bit[7] */
    uint8_t setCoreLevel;         /*!< [EXPERIMENTAL] VDD_CORE DAC code bits[19:15] */
    pmu_ldo_mode_t setLdo0V8Mode; /*!< [EXPERIMENTAL] LDO_VDD_0V8 bits[9:8] */
    pmu_ldo_mode_t setLdo1V8Mode; /*!< [EXPERIMENTAL] LDO_VDD_1V8 bits[11:10] */
    uint8_t setLdoVdda1V8Mode;    /*!< [EXPERIMENTAL] LDO_VDDA_1V8 bits[13:12]: 0=off, 1=HP, 2=LP, 3=ULP */
    bool enableHqref;             /*!< [EXPERIMENTAL] High-quality reference enable bit[6] */
    uint8_t enableSensors;        /*!< [EXPERIMENTAL] Sensor enable mask bits[5:0]:
                                    [0]=Temp, [1]=0V8, [2]=1V8, [3]=Vdda, [4]=Core, [5]=PMU */

