zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_power.h
    /* [EXPERIMENTAL] Clock source standby enable (POWERCON_SOC_CTRL.CSRCCFG_STBY).
     * true  = keep source enabled in standby (sets the corresponding bit).
     * false = allow source to turn off in standby (clears the corresponding bit).
     * Register polarity: bit=1 means source enabled in standby.
     * Default: all true (no gating). */
    bool enableLdoa0V8ClockSource;  /*!< [EXPERIMENTAL] LDOA 0V8 supply (bit 0) */
    bool enableFro192MClockSource;  /*!< [EXPERIMENTAL] FRO 192 MHz (bit 1) */
    bool enableFro12MClockSource;   /*!< [EXPERIMENTAL] FRO 12 MHz (bit 2) */
    bool enableMainPllClockSource;  /*!< [EXPERIMENTAL] Main PLL (bit 3) */
    bool enableCorePllClockSource;  /*!< [EXPERIMENTAL] Core PLL (bit 4) */
    bool enableSysPllClockSource;   /*!< [EXPERIMENTAL] System PLL (bit 5) */
    bool enableLdoq0V8ClockSource;  /*!< [EXPERIMENTAL] LDOQ 0V8 supply (bit 6) */
    bool enableSxoscClockSource;    /*!< [EXPERIMENTAL] SXOSC (bit 7) */
    bool enableFro12MLpClockSource; /*!< [EXPERIMENTAL] FRO 12 MHz LP (bit 8) */

    /* [EXPERIMENTAL] Root clock standby enable (POWERCON_SOC_CTRL.RCGCFG_STBY).
     * true  = keep root clock on in standby (sets  the corresponding bit).
     * false = gate root clock in standby    (clears the corresponding bit).
     * Register polarity: bit=1 means clock ENABLED (active-high).
     * Default for Sleep: all true (no root clock gating during shallow sleep). */
    bool enableComputeRootClock; /*!< [EXPERIMENTAL] COMPUTE_SS root clock (bit 0) */
    bool enableMainRootClock;    /*!< [EXPERIMENTAL] MAIN_SS root clock (bit 1) */
    bool enableWakeRootClock;    /*!< [EXPERIMENTAL] WAKE_SS root clock (bit 2) */
    bool enableCommRootClock;    /*!< [EXPERIMENTAL] COMM_SS root clock (bit 3) */
    bool enableMediaRootClock;   /*!< [EXPERIMENTAL] MEDIA_SS root clock (bit 4) */
    bool enableAudioRootClock;   /*!< [EXPERIMENTAL] AUDIO_SS root clock (bit 5) */
    bool enableWake1MRootClock;  /*!< [EXPERIMENTAL] WAKE_1M root clock (bit 6) */
    bool enableWake2MRootClock;  /*!< [EXPERIMENTAL] WAKE_2M root clock (bit 7) */

    /* [EXPERIMENTAL] Memory standby modes (MEMCON_SLICE.MEM_SLPCFG).
     * Active/Retention/PowerDown all valid in Sleep. */
    memcon_power_mode_t setWakeSramMode; /*!< [EXPERIMENTAL] Wake SRAM 8KB (S0 B0) */
    memcon_power_mode_t setOcramMode;    /*!< [EXPERIMENTAL] OCRAM0 64KB (S2 B0–B7); all blocks set together */
    memcon_power_mode_t setLlcCacheMode; /*!< [EXPERIMENTAL] LLC cache 8KB (S2 B8) */
    memcon_power_mode_t setAudio8KbMode; /*!< [EXPERIMENTAL] Audio SRAM 8KB (S2 B10) */
    memcon_power_mode_t setM85TcmMode;   /*!< [EXPERIMENTAL] M85 CPU TCM + cache (S4 B0–B3, S5 B0) */
    memcon_power_mode_t setNpuTcmMode;   /*!< [EXPERIMENTAL] NPU TCM (S6 B0, S7 B0) */
    memcon_power_mode_t setCommTcmMode;  /*!< [EXPERIMENTAL] COMM SRAM (S10 B0, S11 B0) */
    memcon_power_mode_t setMediaTcmMode; /*!< [EXPERIMENTAL] Media SRAM (S9 B0) */
} power_sleep_config_t;

/*!
 * @brief Deep Sleep config.
 *
 * PD_MAIN, PD_WAKE, PD_BAT always ON.
 * The SSC P-Channel IS triggered in Deep Sleep, so PMU analog fields cause
 * actual hardware state transitions.
 *
 * @note RT2660 does not integrate PDCON domain retention (omitted for die size).
 *       The SW-controllable domain events below are only ever On
 *       (kPDCON_EventNoneOrActive) or PowerOff (kPDCON_EventPowerOff); Deep Sleep
 *       power saving comes from PMU analog/clock state and from powering domains
 *       fully off, not from domain retention.
 *
 * Fields marked [EXPERIMENTAL] may be removed or renamed in a future release.
 *
 * @note Active mode (@ref kMEMCON_PowerModeNormal) is NOT valid for memory
 *       fields in Deep Sleep.  Only Retention and PowerDown are allowed.
 */
typedef struct _power_deep_sleep_config
{
    /* Power domain events (PDCON.PDSLPCFG).
     * RT2660 has no domain retention: use kPDCON_EventNoneOrActive (On) or
     * kPDCON_EventPowerOff only. */
    pdcon_event_t setCpuDomainEvent;   /*!< PD_CPU:   On (NoneOrActive) or PowerOff */
    pdcon_event_t setNpuDomainEvent;   /*!< PD_NPU:   On (NoneOrActive) or PowerOff */
    pdcon_event_t setCommDomainEvent;  /*!< PD_COMM:  On (NoneOrActive) or PowerOff */
    pdcon_event_t setMediaDomainEvent; /*!< PD_MEDIA: On (NoneOrActive) or PowerOff */

    /* [EXPERIMENTAL] PMU analog state (POWERCON_SOC_CTRL.PMUCFG_STBY).
     * SSC P-Channel IS triggered; these fields drive actual analog transitions. */
    uint8_t setPmuMode;           /*!< [EXPERIMENTAL] PMU mode bits[22:20]: 0=HP, 2=LP, 3=RET */
    pmu_dcdc_mode_t setDcdcMode;  /*!< [EXPERIMENTAL] DCDC mode bit[7] */
    uint8_t setCoreLevel;         /*!< [EXPERIMENTAL] VDD_CORE DAC code bits[19:15] */
    pmu_ldo_mode_t setLdo0V8Mode; /*!< [EXPERIMENTAL] LDO_VDD_0V8 bits[9:8] */
    pmu_ldo_mode_t setLdo1V8Mode; /*!< [EXPERIMENTAL] LDO_VDD_1V8 bits[11:10] */
    uint8_t setLdoVdda1V8Mode;    /*!< [EXPERIMENTAL] LDO_VDDA_1V8 bits[13:12]: 0=off, 1=HP, 2=LP, 3=ULP */
    bool enableHqref;             /*!< [EXPERIMENTAL] High-quality reference enable bit[6] */
    uint8_t enableSensors;        /*!< [EXPERIMENTAL] Sensor enable mask bits[5:0]:
                                    [0]=Temp, [1]=0V8, [2]=1V8, [3]=Vdda, [4]=Core, [5]=PMU */

    /* [EXPERIMENTAL] Clock source standby enable (POWERCON_SOC_CTRL.CSRCCFG_STBY).
     * true  = keep source enabled; false = allow source to turn off.
     * Register polarity: bit=1 means source enabled in standby.
     * Default: all false (all sources gated). */
    bool enableLdoa0V8ClockSource;  /*!< [EXPERIMENTAL] LDOA 0V8 supply (bit 0) */
    bool enableFro192MClockSource;  /*!< [EXPERIMENTAL] FRO 192 MHz (bit 1) */
    bool enableFro12MClockSource;   /*!< [EXPERIMENTAL] FRO 12 MHz (bit 2) */
    bool enableMainPllClockSource;  /*!< [EXPERIMENTAL] Main PLL (bit 3) */
    bool enableCorePllClockSource;  /*!< [EXPERIMENTAL] Core PLL (bit 4) */
    bool enableSysPllClockSource;   /*!< [EXPERIMENTAL] System PLL (bit 5) */
    bool enableLdoq0V8ClockSource;  /*!< [EXPERIMENTAL] LDOQ 0V8 supply (bit 6) */
    bool enableSxoscClockSource;    /*!< [EXPERIMENTAL] SXOSC (bit 7) */
    bool enableFro12MLpClockSource; /*!< [EXPERIMENTAL] FRO 12 MHz LP (bit 8) */

