zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_power.h
    /* [EXPERIMENTAL] Root clock standby enable (POWERCON_SOC_CTRL.RCGCFG_STBY).
     * true  = keep root clock on in standby (sets  the corresponding bit).
     * false = gate root clock in standby    (clears the corresponding bit).
     * Register polarity: bit=1 means clock ENABLED (active-high).
     * Default for Deep Sleep: only enableWake1MRootClock and enableWake2MRootClock are true; all others false
     * (POWERCON wakeup-detection logic requires the 1M/2M WAKE clocks to run). */
    bool enableComputeRootClock; /*!< [EXPERIMENTAL] COMPUTE_SS root clock (bit 0) */
    bool enableMainRootClock;    /*!< [EXPERIMENTAL] MAIN_SS root clock (bit 1) */
    bool enableWakeRootClock;    /*!< [EXPERIMENTAL] WAKE_SS root clock (bit 2) */
    bool enableCommRootClock;    /*!< [EXPERIMENTAL] COMM_SS root clock (bit 3) */
    bool enableMediaRootClock;   /*!< [EXPERIMENTAL] MEDIA_SS root clock (bit 4) */
    bool enableAudioRootClock;   /*!< [EXPERIMENTAL] AUDIO_SS root clock (bit 5) */
    bool enableWake1MRootClock;  /*!< [EXPERIMENTAL] WAKE_1M root clock (bit 6); keep true for wakeup logic */
    bool enableWake2MRootClock;  /*!< [EXPERIMENTAL] WAKE_2M root clock (bit 7); keep true for wakeup logic */

    /* [EXPERIMENTAL] Memory standby modes (MEMCON_SLICE.MEM_SLPCFG).
     * Active (kMEMCON_PowerModeNormal) is NOT valid in Deep Sleep. */
    memcon_power_mode_t setWakeSramMode; /*!< [EXPERIMENTAL] Wake SRAM 8KB (S0 B0) */
    memcon_power_mode_t setOcramMode;    /*!< [EXPERIMENTAL] OCRAM0 64KB (S2 B0–B7); all blocks set together */
    memcon_power_mode_t setLlcCacheMode; /*!< [EXPERIMENTAL] LLC cache 8KB (S2 B8) */
    memcon_power_mode_t setAudio8KbMode; /*!< [EXPERIMENTAL] Audio SRAM 8KB (S2 B10) */
    memcon_power_mode_t setM85TcmMode;   /*!< [EXPERIMENTAL] M85 CPU TCM + cache (S4 B0–B3, S5 B0) */
    memcon_power_mode_t setNpuTcmMode;   /*!< [EXPERIMENTAL] NPU TCM (S6 B0, S7 B0) */
    memcon_power_mode_t setCommTcmMode;  /*!< [EXPERIMENTAL] COMM SRAM (S10 B0, S11 B0) */
    memcon_power_mode_t setMediaTcmMode; /*!< [EXPERIMENTAL] Media SRAM (S9 B0) */
} power_deep_sleep_config_t;

/*!
 * @brief Power Down config.
 *
 * Domain events and PMU state are fixed (all SW-controllable domains power-off;
 * pmuMode=RET, DCDC off).
 *
 * Fields marked [EXPERIMENTAL] may be removed or renamed in a future release.
 *
 * @note POWER_EnterPowerDown() does NOT return.  Wakeup triggers a fast PoR.
 */
typedef struct _power_down_config
{
    uint32_t retainOcram0KB; /*!< OCRAM0 kilobytes to retain (0-64).  0 = no retention. */
    bool retainPkcMem;       /*!< Retain PKC MEM 4KB (S2 B11). */
    bool retainLlcCache;     /*!< [EXPERIMENTAL] Retain LLC cache 8KB (S2 B8). */
    bool retainAudio8Kb;     /*!< [EXPERIMENTAL] Retain Audio SRAM 8KB (S2 B10). */
} power_down_config_t;

/*!
 * @brief Deep Power Down config - covers both DPD1 and DPD2 variants.
 *
 * DPD1 (retainVbatSram=true):  VBAT_SS powered; 2 KB VBAT SRAM retained.
 * DPD2 (retainVbatSram=false): VBAT_SS off; PMIC_CTRL asserted (VDD_PMU removed).
 *
 * @note This function does NOT return.  Wakeup via PMIC restoring VDD_PMU.
 */
typedef struct _power_deep_power_down_config
{
    bool retainVbatSram; /*!< true=DPD1 (VBAT_SS powered, SRAM retained), false=DPD2 (PMIC_CTRL asserted). */
} power_deep_power_down_config_t;

/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @name Initialisation
 * @{
 */

/*!
 * @brief Fill power_policy_config_t with hardware reset defaults.
 *
 * All CMC and SSC steps set to Handshake mode; CSSI enabled and unlocked;
 * handshakeRouting set to NULL (POWER_SetPolicy will apply POR-default routing).
 *
 * @param config  Pointer to config struct to populate.  Must not be NULL.
 */
void POWER_GetDefaultPolicyConfig(power_policy_config_t *config);

/*!
 * @brief Applies the power management policy: active/low-power baseline for
 *        POWERCON, PDCON, and MEMCON, plus the NPU/Media/Comm domain and
 *        active-mode clock source state.
 *
 * Enables POWERCON, PDCON, and MEMCON function clocks; applies SoC handshake
 * routing (NULL = POR defaults, non-NULL = *config->handshakeRouting); configures
 * CMC/SSC step modes and CSSI; sets the standby-gating baseline (XMC_STBY_MASK);
 * initialises PDCON domain trigger config; enables active-mode clock sources 0-8;
 * brings the NPU/Media/Comm domains to kPDCON_EventNoneOrActive if not already
 * there (idempotent); initialises all MEMCON slices to their default active
 * states; initialises SW wakeup masks to all-masked.
 *
 * Safe to call more than once (e.g. to apply a different handshakeRouting later).
 * No ordering constraint relative to BOARD_InitBootClocks() -- the domain-enable
 * step runs before the MEMCON slice writes internally, so a MEMCON slice is
 * never touched before its hosting domain (NPU/Media/Comm) is powered active.
 *
 * @param config  Pointer to policy configuration. Must not be NULL.
 *                Call POWER_GetDefaultPolicyConfig() first to populate defaults,
 *                then adjust fields as needed before passing to this function.
 */
void POWER_SetPolicy(const power_policy_config_t *config);

#if MCUX_POWER_PF9453_SUPPLY
/*!
 * @brief Brings up the external PF9453 PMIC that supplies VDD_CORE (BUCK2). PMIC build only.
 *
 * Creates the internal PF9453 handle from the board-supplied I2C transport and performs a one-shot
 * BUCK2 bring-up (enable in ACTIVE/STANDBY, run 0.9 V, standby 0.65 V, DVS ramp), then arms the
 * internal ready flag so subsequent run-mode DVS / standby-target changes drive the PMIC.
 *
 * MUST be called before the board's boot-clock setup (which ramps the core to HP and needs BUCK2
 * already at 0.9 V) — i.e. as the first step of board bring-up, before the clock tree is programmed.
 * The I2C send/receive callbacks in @p config must be non-NULL (asserted).
 *
 * @param config  Pointer to the external-supply I2C transport config. Must not be NULL.
 */
void POWER_InitExtSupply(const power_ext_supply_config_t *config);
#endif

/*!
 * @brief Fill power_handshake_routing_config_t with POR-default routing values.
 *
 * All HSK_SEL fields are set to 0 (hardware reset default).
 * All domainHsk entries are set to 0 (no explicit handshake units).
 *
 * @param config  Pointer to config struct to populate.  Must not be NULL.
 */
void POWER_GetDefaultHandshakeRoutingConfig(power_handshake_routing_config_t *config);

/*!
 * @brief Apply the init-time SoC handshake routing configuration.
 *
 * Writes POWERCON HSK_SEL registers and PDCON HSKCTRL for all six domains.
 * Must be called after POWER_InitStepCtrl() and before the first standby entry.
 * Call with POR-default config (from POWER_GetDefaultHandshakeRoutingConfig()) for the
 * standard routing, or customize fields for non-default routing.
 *
 * @param config  Pointer to handshake routing config.  Must not be NULL.
 */
void POWER_SetHandshakeRouting(const power_handshake_routing_config_t *config);

/*! @} */

/*!
 * @name Wakeup Source Control
 * @{
 */

/*!
 * @brief Accumulates a wakeup source into the driver-private SW state.
 *
 * No register access; registers are written inside POWER_Enter*() via
 * POWER_ApplyWakeupSources().  State persists across Sleep/Deep Sleep entries.
 *
 * @param source  Encoded wakeup source.  Construct with @ref POWER_WAKEUP_IRQ,
 *                @ref POWER_WAKEUP_MAIN_DMA, or @ref POWER_WAKEUP_WAKE_DMA.
 */
void POWER_EnableWakeupSource(power_wakeup_source_t source);

/*!
 * @brief Removes a wakeup source from the driver-private SW state.
 *
 * @param source  Encoded wakeup source, same value as passed to
 *                @ref POWER_EnableWakeupSource.
 */
void POWER_DisableWakeupSource(power_wakeup_source_t source);

/*!
 * @brief Masks all accumulated wakeup sources (IRQ, DMA, debug).
 *
 * Call before re-configuring the wakeup source between consecutive standby entries.
 */
void POWER_ClearAllWakeupSources(void);

/*!
 * @brief Flushes the accumulated SW wakeup masks to the CMC0/1/2 hardware registers.
 *
 * Writes each driver-private shadow mask to the CMC that owns it on RT2660:
 *   - CMC0 IRQ_WAKEUP_MASK  <- IRQ wakeup shadow (CPU / M85 core)
 *   - CMC1 DMA_WAKEUP_MASK  <- MAIN-domain DMA wakeup shadow
 *   - CMC2 DMA_WAKEUP_MASK  <- WAKE-domain DMA wakeup shadow
 *
 * This is called automatically inside every POWER_Enter*() before WFI, so an
 * application that always enters low power through those APIs does not need to
 * call it.  It is exposed for callers that arm wakeup sources ahead of a bare
 * @c __WFI() outside the POWER_Enter*() paths, or that want the CMC mask
 * registers written immediately after POWER_EnableWakeupSource() /
 * POWER_DisableWakeupSource() (e.g. for inspection).  The function is idempotent
 * — it rewrites all CMC masks from the shadow arrays — so an extra call before a
 * POWER_Enter*() is harmless.
 */
void POWER_ApplyWakeupSources(void);

/*! @} */

/*!
 * @name Active Mode Control
 * @{
 */

/*!
 * @brief Software-triggered power domain state change during active operation.
 *
 * @param domain  Target power domain. See @ref power_domain_t.
 * @param event   Target event. See @ref pdcon_event_t. RT2660 does not integrate PDCON
 *                domain retention, so use kPDCON_EventNoneOrActive (On) or
 *                kPDCON_EventPowerOff only; kPDCON_EventRetention must not be used.
 * @retval kStatus_Success  Transition completed.
 */
status_t POWER_SetDomainRunMode(power_domain_t domain, pdcon_event_t event);

/*!
 * @brief Set SRAM block active-mode power state and apply immediately.
 *
 * @param mem   Memory identifier.  See @ref power_memory_t.
 * @param mode  Target power mode.  See @ref memcon_power_mode_t.
 * @retval kStatus_Success            Configuration applied.
 * @retval kStatus_InvalidArgument    Memory does not support SW trigger.
 */
status_t POWER_SetMemoryRunMode(power_memory_t mem, memcon_power_mode_t mode);

/*!
 * @brief Enable a subsystem root clock during active mode.
 *
 * RMW clears the corresponding bit in POWERCON_SOC_CTRL.RCGCFG_ACTIVE.
 * RCGCFG_ACTIVE uses active-low polarity: 0b=enables, 1b=disables.
 * Direct register write - no P-Channel trigger required.
 *
 * @param ss  Subsystem root clock identifier.
 */
void POWER_EnableRunRootClock(power_root_clock_t ss);

/*!
 * @brief Disable a subsystem root clock during active mode.
 *
 * RMW sets the corresponding bit in POWERCON_SOC_CTRL.RCGCFG_ACTIVE.
 * Caller MUST ensure no active consumer depends on this root clock.
 * Direct register write - no P-Channel trigger required.
 *
 * @param ss  Subsystem root clock identifier.
 */
void POWER_DisableRunRootClock(power_root_clock_t ss);

/*!
 * @brief Enable a clock source during active mode via POWERCON P-Channel.
 *
 * Sets the corresponding bit in CSRCCFG_ACTIVE (1b=enables, 0b=disables).
 * Read-modify-write, then trigger SOC P-Channel update and poll for completion.
 * Active-high polarity - opposite of RCGCFG_ACTIVE.
 *
 * @param src  Clock source bit index (@ref power_clock_source_t).
 */
void POWER_EnableRunClockSource(power_clock_source_t src);

/*!
 * @brief Disable a clock source during active mode via POWERCON P-Channel.
 *
 * Clears the corresponding bit in CSRCCFG_ACTIVE (1b=enables, 0b=disables).
 * Caller MUST ensure no active consumer uses this source.
 * Do NOT call while the CMC FSM is active.
 *
 * @param src  Clock source bit index (@ref power_clock_source_t).
 */
void POWER_DisableRunClockSource(power_clock_source_t src);

/*!
 * @brief Apply PMU regulator config and synchronize PMUCFG_ACTIVE through
 *        POWERCON P-channel handshake.
 */
void POWER_SetRunRegulatorsConfig(const power_run_regulators_config_t *config);

/*!
 * @brief Assert or deassert the PMIC standby request while the chip is in Run mode.
 *
 * Writes PMICCFG_ACTIVE: enable=true sets PMIC_MODE[1:0]=1 (standby request asserted);
 * enable=false clears the field (no standby request).
 * Takes effect immediately - no P-Channel trigger is required.
 *
 * @param enable  true = assert PMIC standby request; false = deassert.
 */
void POWER_EnableRunPmicStandbyRequest(bool enable);

/*!
 * @brief Switch to HP run mode (VDD_CORE=0.9 V, FBB, CM85 up to 1 GHz).
 *
 * Determines the current run mode from hardware body-bias state, applies the
 * correct voltage/clock ordering (raises voltage before calling @p clockCb when
 * coming from a lower-voltage mode), then applies HP regulator settings and FBB.
 *
 * @param clockCb  Callback invoked at the point in the sequence where CCM
 *                 frequencies should be changed to HP values.  May be NULL.
 */
void POWER_EnterHpRun(power_clock_cb_t clockCb);

/*!
 * @brief Switch to Normal run mode (VDD_CORE=0.8 V, FBB, CM85 up to 800 MHz).
 *
 * @param clockCb  Callback invoked at the point where CCM frequencies should
 *                 be changed to Normal run values.  May be NULL.
 */
void POWER_EnterNormalRun(power_clock_cb_t clockCb);

/*!
 * @brief Switch to LP run mode (VDD_CORE=0.8 V, ZBB, CM85 up to 600 MHz).
 *
 * @param clockCb  Callback invoked at the point where CCM frequencies should
 *                 be changed to LP values.  May be NULL.
 */
void POWER_EnterLpRun(power_clock_cb_t clockCb);

/*!
 * @brief Get the current active run mode.
 *
 * Classifies the run mode from the CPU core clock frequency
 * (`CLOCK_GetRootClockFreq(kCLOCK_Root_CGU_MAIN_ROOTCLK)`): >= 900 MHz -> HP,
 * >= 700 MHz -> Normal, otherwise -> LP.  Thresholds carry margin because
 * Normal Run is typically ~792 MHz rather than an exact 800 MHz.
 *
 * Reflects the instantaneous core frequency, so query it from a settled
 * operating point (not mid-transition, and not while the CPU is transiently
 * parked on a low-frequency source).
 *
 * @return The current @ref power_run_mode_t.
 */
power_run_mode_t POWER_GetCurrentRunMode(void);

/*! @} */

/*!
 * @name Standby Entry
 * @{
 */

/*!
 * @brief Configure whether the CSSI/ELS LP handshake is bypassed on standby entry.
 *
 * The full production handshake communicates with the CSSI (S110 / ELE) security
 * subsystem via MU before each low-power entry.  CSSI must grant permission before
 * the entry sequence proceeds; if CSSI denies, POWER_EnterSleep() and
 * POWER_EnterDeepSleep() return @ref kStatus_Fail.
 *
 * @warning TEST ONLY - bypass mode is the default (bypass=true) because CSSI
 *          firmware is not yet available for early bring-up testing.  Call
 *          POWER_SetCssiLpHandshakeBypass(false) before production validation
 *          once CSSI firmware is ready.  Do NOT ship products with bypass=true.
 *
 * Communication with CSSI uses the Messaging Unit (MU).  The full handshake
 * sequence will be added here when the CSSI firmware MU protocol is finalised.
 *
 * @param bypass  true  = skip CSSI handshake entirely (TEST ONLY, default).
 *                false = perform the full MU + MODCON handshake.
 */
void POWER_SetCssiLpHandshakeBypass(bool bypass);

/*!
 * @brief Enter Sleep mode; returns after wakeup.
 *
 * @note PLL clock outputs: if MAINPLL or SYSPLL was kept enabled in standby
 *       (config->enableMainPllClockSource / config->enableSysPllClockSource = true), only the DIV4 output of each
 *       PLL is automatically re-enabled by hardware on wakeup.  All other outputs
 *       (DIV5, DIV8, DIV10, DIV20, PFD0/1/2) remain gated.  The caller must
 *       re-enable any required non-DIV4 PLL outputs after this function returns.
 *
 * @param config  Pointer to sleep configuration.
 * @retval kStatus_Success         Wakeup occurred normally.
 * @retval kStatus_InvalidArgument config is NULL.
 * @retval kStatus_Fail            CSSI denied LP entry (bypass=false only).
 */
status_t POWER_EnterSleep(const power_sleep_config_t *config);

/*!
 * @brief Enter Deep Sleep mode; returns after wakeup (~150 µs restore).
 *
 * WAKE-domain LPUART clocks are gated during Deep Sleep.  If a WAKE-domain
 * LPUART is active, the caller must stop transmitting and deinitialize the
 * peripheral before entry, and reinitialize it after return.
 *
 * @pre The M85 CPU core clock (SYSCON CCM root clock 1) must be sourced from
 *      COREPLL before calling this function.  MAINPLL and SYSPLL are typically
 *      gated during Deep Sleep standby; running the CPU from a MAINPLL/SYSPLL-
 *      derived clock at WFI will cause the CPU to stall when those PLLs are
 *      gated by POWERCON.  COREPLL frequency is preserved across Deep Sleep
 *      without a reset, so no CPU clock restoration is needed after return.
 *
 * @note PLL clock outputs: on wakeup from Deep Sleep, only the DIV4 output of
 *       MAINPLL and SYSPLL is automatically re-enabled by hardware.  All other
 *       outputs (DIV5, DIV8, DIV10, DIV20, PFD0/1/2) remain gated.  The caller
 *       must re-enable any required non-DIV4 PLL outputs after this function
 *       returns before using peripherals that depend on them.
 *
 * @note This function returns only when M85 TCM and stack memory were retained
 *       (setM85TcmMode = kMEMCON_PowerModeRetention).  If TCM was powered off the
 *       wakeup path is a PoR reboot and this function never returns.
 *
 * @param config  Pointer to deep sleep configuration.
 * @retval kStatus_Success         Wakeup occurred normally.
 * @retval kStatus_InvalidArgument config is NULL.
 * @retval kStatus_Fail            CSSI denied LP entry (bypass=false only).
 */
status_t POWER_EnterDeepSleep(const power_deep_sleep_config_t *config);

/*!
 * @brief Enter Power Down mode.
 *
 * On successful entry the CPU does not return: wakeup triggers a fast PoR.
 * Returns @ref kStatus_Fail before executing WFI if the CSSI/ELS LP handshake
 * denies entry (only possible when bypass is disabled via
 * @ref POWER_SetCssiLpHandshakeBypass). In the default (bypass=true) state
 * this function always proceeds to WFI.
 *
 * @param config  Pointer to power down configuration.  Must not be NULL.
 * @retval kStatus_Fail  CSSI denied LP entry (bypass=false only).
 */
status_t POWER_EnterPowerDown(const power_down_config_t *config);

/*!
 * @brief Enter Deep Power Down mode.
 *
 * On successful entry the CPU does not return: wakeup via PMIC restoring
 * VDD_PMU triggers a PoR.  Configure VBATCON wakeup latches directly before
 * calling this function.
 * Returns @ref kStatus_Fail before executing WFI if the CSSI/ELS LP handshake
 * denies entry (only possible when bypass is disabled via
 * @ref POWER_SetCssiLpHandshakeBypass).
 *
 * @param config  Pointer to deep power down configuration.  Must not be NULL.
 * @retval kStatus_Fail  CSSI denied LP entry (bypass=false only).
 */
status_t POWER_EnterDeepPowerDown(const power_deep_power_down_config_t *config);

/*! @} */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* FSL_POWER_H */
